rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
/*
** ###################################################################
**     Processor:           S32K388_M7
**     Reference manual:    S32K3xx RM Rev.8 Draft B
**     Version:             rev. 1.3, 2023-09-12
**     Build:               b230922
**
**     Abstract:
**         Peripheral Access Layer for S32K388_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K388_FEED_DMA_TCD.h
 * @version 1.3
 * @date 2023-09-12
 * @brief Peripheral Access Layer for S32K388_FEED_DMA_TCD
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K388_FEED_DMA_TCD_H_)  /* Check if memory map has not been already included */
#define S32K388_FEED_DMA_TCD_H_

#include "S32K388_COMMON.h"

/* ----------------------------------------------------------------------------
   -- FEED_DMA_TCD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FEED_DMA_TCD_Peripheral_Access_Layer FEED_DMA_TCD Peripheral Access Layer
 * @{
 */

/** FEED_DMA_TCD - Register Layout Typedef */
typedef struct {
  __IO uint32_t CH0_CSR;                           /**< Channel Control and Status, offset: 0x0 */
  __IO uint32_t CH0_ES;                            /**< Channel Error Status, offset: 0x4 */
  __IO uint32_t CH0_INT;                           /**< Channel Interrupt Status, offset: 0x8 */
  __IO uint32_t CH0_SBR;                           /**< Channel System Bus, offset: 0xC */
  __IO uint32_t CH0_PRI;                           /**< Channel Priority, offset: 0x10 */
  uint8_t RESERVED_0[12];
  __IO uint32_t TCD0_SADDR;                        /**< TCD Source Address, offset: 0x20 */
  __IO uint16_t TCD0_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x24 */
  __IO uint16_t TCD0_ATTR;                         /**< TCD Transfer Attributes, offset: 0x26 */
  union {                                          /* offset: 0x28 */
    __IO uint32_t TCD0_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x28 */
    __IO uint32_t TCD0_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x28 */
  } NBYTES0;
  __IO uint32_t TCD0_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2C */
  __IO uint32_t TCD0_DADDR;                        /**< TCD Destination Address, offset: 0x30 */
  __IO uint16_t TCD0_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x34 */
  union {                                          /* offset: 0x36 */
    __IO uint16_t TCD0_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x36 */
    __IO uint16_t TCD0_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x36 */
  } CITER0;
  __IO uint32_t TCD0_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x38 */
  __IO uint16_t TCD0_CSR;                          /**< TCD Control and Status, offset: 0x3C */
  union {                                          /* offset: 0x3E */
    __IO uint16_t TCD0_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3E */
    __IO uint16_t TCD0_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3E */
  } BITER0;
  uint8_t RESERVED_1[4032];
  __IO uint32_t CH8_CSR;                           /**< Channel Control and Status, offset: 0x1000 */
  __IO uint32_t CH8_ES;                            /**< Channel Error Status, offset: 0x1004 */
  __IO uint32_t CH8_INT;                           /**< Channel Interrupt Status, offset: 0x1008 */
  __IO uint32_t CH8_SBR;                           /**< Channel System Bus, offset: 0x100C */
  __IO uint32_t CH8_PRI;                           /**< Channel Priority, offset: 0x1010 */
  uint8_t RESERVED_2[12];
  __IO uint32_t TCD8_SADDR;                        /**< TCD Source Address, offset: 0x1020 */
  __IO uint16_t TCD8_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x1024 */
  __IO uint16_t TCD8_ATTR;                         /**< TCD Transfer Attributes, offset: 0x1026 */
  union {                                          /* offset: 0x1028 */
    __IO uint32_t TCD8_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x1028 */
    __IO uint32_t TCD8_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x1028 */
  } NBYTES8;
  __IO uint32_t TCD8_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x102C */
  __IO uint32_t TCD8_DADDR;                        /**< TCD Destination Address, offset: 0x1030 */
  __IO uint16_t TCD8_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x1034 */
  union {                                          /* offset: 0x1036 */
    __IO uint16_t TCD8_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1036 */
    __IO uint16_t TCD8_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1036 */
  } CITER8;
  __IO uint32_t TCD8_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x1038 */
  __IO uint16_t TCD8_CSR;                          /**< TCD Control and Status, offset: 0x103C */
  union {                                          /* offset: 0x103E */
    __IO uint16_t TCD8_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x103E */
    __IO uint16_t TCD8_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x103E */
  } BITER8;
  uint8_t RESERVED_3[4032];
  __IO uint32_t CH16_CSR;                          /**< Channel Control and Status, offset: 0x2000 */
  __IO uint32_t CH16_ES;                           /**< Channel Error Status, offset: 0x2004 */
  __IO uint32_t CH16_INT;                          /**< Channel Interrupt Status, offset: 0x2008 */
  __IO uint32_t CH16_SBR;                          /**< Channel System Bus, offset: 0x200C */
  __IO uint32_t CH16_PRI;                          /**< Channel Priority, offset: 0x2010 */
  uint8_t RESERVED_4[12];
  __IO uint32_t TCD16_SADDR;                       /**< TCD Source Address, offset: 0x2020 */
  __IO uint16_t TCD16_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x2024 */
  __IO uint16_t TCD16_ATTR;                        /**< TCD Transfer Attributes, offset: 0x2026 */
  union {                                          /* offset: 0x2028 */
    __IO uint32_t TCD16_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x2028 */
    __IO uint32_t TCD16_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x2028 */
  } NBYTES16;
  __IO uint32_t TCD16_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x202C */
  __IO uint32_t TCD16_DADDR;                       /**< TCD Destination Address, offset: 0x2030 */
  __IO uint16_t TCD16_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x2034 */
  union {                                          /* offset: 0x2036 */
    __IO uint16_t TCD16_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2036 */
    __IO uint16_t TCD16_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2036 */
  } CITER16;
  __IO uint32_t TCD16_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x2038 */
  __IO uint16_t TCD16_CSR;                         /**< TCD Control and Status, offset: 0x203C */
  union {                                          /* offset: 0x203E */
    __IO uint16_t TCD16_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x203E */
    __IO uint16_t TCD16_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x203E */
  } BITER16;
  uint8_t RESERVED_5[4032];
  __IO uint32_t CH24_CSR;                          /**< Channel Control and Status, offset: 0x3000 */
  __IO uint32_t CH24_ES;                           /**< Channel Error Status, offset: 0x3004 */
  __IO uint32_t CH24_INT;                          /**< Channel Interrupt Status, offset: 0x3008 */
  __IO uint32_t CH24_SBR;                          /**< Channel System Bus, offset: 0x300C */
  __IO uint32_t CH24_PRI;                          /**< Channel Priority, offset: 0x3010 */
  uint8_t RESERVED_6[12];
  __IO uint32_t TCD24_SADDR;                       /**< TCD Source Address, offset: 0x3020 */
  __IO uint16_t TCD24_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x3024 */
  __IO uint16_t TCD24_ATTR;                        /**< TCD Transfer Attributes, offset: 0x3026 */
  union {                                          /* offset: 0x3028 */
    __IO uint32_t TCD24_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x3028 */
    __IO uint32_t TCD24_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x3028 */
  } NBYTES24;
  __IO uint32_t TCD24_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x302C */
  __IO uint32_t TCD24_DADDR;                       /**< TCD Destination Address, offset: 0x3030 */
  __IO uint16_t TCD24_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x3034 */
  union {                                          /* offset: 0x3036 */
    __IO uint16_t TCD24_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x3036 */
    __IO uint16_t TCD24_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x3036 */
  } CITER24;
  __IO uint32_t TCD24_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x3038 */
  __IO uint16_t TCD24_CSR;                         /**< TCD Control and Status, offset: 0x303C */
  union {                                          /* offset: 0x303E */
    __IO uint16_t TCD24_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x303E */
    __IO uint16_t TCD24_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x303E */
  } BITER24;
  uint8_t RESERVED_7[53184];
  __IO uint32_t CH1_CSR;                           /**< Channel Control and Status, offset: 0x10000 */
  __IO uint32_t CH1_ES;                            /**< Channel Error Status, offset: 0x10004 */
  __IO uint32_t CH1_INT;                           /**< Channel Interrupt Status, offset: 0x10008 */
  __IO uint32_t CH1_SBR;                           /**< Channel System Bus, offset: 0x1000C */
  __IO uint32_t CH1_PRI;                           /**< Channel Priority, offset: 0x10010 */
  uint8_t RESERVED_8[12];
  __IO uint32_t TCD1_SADDR;                        /**< TCD Source Address, offset: 0x10020 */
  __IO uint16_t TCD1_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x10024 */
  __IO uint16_t TCD1_ATTR;                         /**< TCD Transfer Attributes, offset: 0x10026 */
  union {                                          /* offset: 0x10028 */
    __IO uint32_t TCD1_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x10028 */
    __IO uint32_t TCD1_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x10028 */
  } NBYTES1;
  __IO uint32_t TCD1_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x1002C */
  __IO uint32_t TCD1_DADDR;                        /**< TCD Destination Address, offset: 0x10030 */
  __IO uint16_t TCD1_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x10034 */
  union {                                          /* offset: 0x10036 */
    __IO uint16_t TCD1_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x10036 */
    __IO uint16_t TCD1_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x10036 */
  } CITER1;
  __IO uint32_t TCD1_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x10038 */
  __IO uint16_t TCD1_CSR;                          /**< TCD Control and Status, offset: 0x1003C */
  union {                                          /* offset: 0x1003E */
    __IO uint16_t TCD1_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1003E */
    __IO uint16_t TCD1_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1003E */
  } BITER1;
  uint8_t RESERVED_9[4032];
  __IO uint32_t CH9_CSR;                           /**< Channel Control and Status, offset: 0x11000 */
  __IO uint32_t CH9_ES;                            /**< Channel Error Status, offset: 0x11004 */
  __IO uint32_t CH9_INT;                           /**< Channel Interrupt Status, offset: 0x11008 */
  __IO uint32_t CH9_SBR;                           /**< Channel System Bus, offset: 0x1100C */
  __IO uint32_t CH9_PRI;                           /**< Channel Priority, offset: 0x11010 */
  uint8_t RESERVED_10[12];
  __IO uint32_t TCD9_SADDR;                        /**< TCD Source Address, offset: 0x11020 */
  __IO uint16_t TCD9_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x11024 */
  __IO uint16_t TCD9_ATTR;                         /**< TCD Transfer Attributes, offset: 0x11026 */
  union {                                          /* offset: 0x11028 */
    __IO uint32_t TCD9_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x11028 */
    __IO uint32_t TCD9_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x11028 */
  } NBYTES9;
  __IO uint32_t TCD9_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x1102C */
  __IO uint32_t TCD9_DADDR;                        /**< TCD Destination Address, offset: 0x11030 */
  __IO uint16_t TCD9_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x11034 */
  union {                                          /* offset: 0x11036 */
    __IO uint16_t TCD9_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x11036 */
    __IO uint16_t TCD9_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x11036 */
  } CITER9;
  __IO uint32_t TCD9_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x11038 */
  __IO uint16_t TCD9_CSR;                          /**< TCD Control and Status, offset: 0x1103C */
  union {                                          /* offset: 0x1103E */
    __IO uint16_t TCD9_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1103E */
    __IO uint16_t TCD9_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1103E */
  } BITER9;
  uint8_t RESERVED_11[4032];
  __IO uint32_t CH17_CSR;                          /**< Channel Control and Status, offset: 0x12000 */
  __IO uint32_t CH17_ES;                           /**< Channel Error Status, offset: 0x12004 */
  __IO uint32_t CH17_INT;                          /**< Channel Interrupt Status, offset: 0x12008 */
  __IO uint32_t CH17_SBR;                          /**< Channel System Bus, offset: 0x1200C */
  __IO uint32_t CH17_PRI;                          /**< Channel Priority, offset: 0x12010 */
  uint8_t RESERVED_12[12];
  __IO uint32_t TCD17_SADDR;                       /**< TCD Source Address, offset: 0x12020 */
  __IO uint16_t TCD17_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x12024 */
  __IO uint16_t TCD17_ATTR;                        /**< TCD Transfer Attributes, offset: 0x12026 */
  union {                                          /* offset: 0x12028 */
    __IO uint32_t TCD17_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x12028 */
    __IO uint32_t TCD17_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x12028 */
  } NBYTES17;
  __IO uint32_t TCD17_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x1202C */
  __IO uint32_t TCD17_DADDR;                       /**< TCD Destination Address, offset: 0x12030 */
  __IO uint16_t TCD17_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x12034 */
  union {                                          /* offset: 0x12036 */
    __IO uint16_t TCD17_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x12036 */
    __IO uint16_t TCD17_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x12036 */
  } CITER17;
  __IO uint32_t TCD17_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x12038 */
  __IO uint16_t TCD17_CSR;                         /**< TCD Control and Status, offset: 0x1203C */
  union {                                          /* offset: 0x1203E */
    __IO uint16_t TCD17_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1203E */
    __IO uint16_t TCD17_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1203E */
  } BITER17;
  uint8_t RESERVED_13[4032];
  __IO uint32_t CH25_CSR;                          /**< Channel Control and Status, offset: 0x13000 */
  __IO uint32_t CH25_ES;                           /**< Channel Error Status, offset: 0x13004 */
  __IO uint32_t CH25_INT;                          /**< Channel Interrupt Status, offset: 0x13008 */
  __IO uint32_t CH25_SBR;                          /**< Channel System Bus, offset: 0x1300C */
  __IO uint32_t CH25_PRI;                          /**< Channel Priority, offset: 0x13010 */
  uint8_t RESERVED_14[12];
  __IO uint32_t TCD25_SADDR;                       /**< TCD Source Address, offset: 0x13020 */
  __IO uint16_t TCD25_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x13024 */
  __IO uint16_t TCD25_ATTR;                        /**< TCD Transfer Attributes, offset: 0x13026 */
  union {                                          /* offset: 0x13028 */
    __IO uint32_t TCD25_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x13028 */
    __IO uint32_t TCD25_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x13028 */
  } NBYTES25;
  __IO uint32_t TCD25_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x1302C */
  __IO uint32_t TCD25_DADDR;                       /**< TCD Destination Address, offset: 0x13030 */
  __IO uint16_t TCD25_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x13034 */
  union {                                          /* offset: 0x13036 */
    __IO uint16_t TCD25_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x13036 */
    __IO uint16_t TCD25_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x13036 */
  } CITER25;
  __IO uint32_t TCD25_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x13038 */
  __IO uint16_t TCD25_CSR;                         /**< TCD Control and Status, offset: 0x1303C */
  union {                                          /* offset: 0x1303E */
    __IO uint16_t TCD25_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x1303E */
    __IO uint16_t TCD25_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x1303E */
  } BITER25;
  uint8_t RESERVED_15[53184];
  __IO uint32_t CH2_CSR;                           /**< Channel Control and Status, offset: 0x20000 */
  __IO uint32_t CH2_ES;                            /**< Channel Error Status, offset: 0x20004 */
  __IO uint32_t CH2_INT;                           /**< Channel Interrupt Status, offset: 0x20008 */
  __IO uint32_t CH2_SBR;                           /**< Channel System Bus, offset: 0x2000C */
  __IO uint32_t CH2_PRI;                           /**< Channel Priority, offset: 0x20010 */
  uint8_t RESERVED_16[12];
