rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
  __IO uint32_t TCD2_SADDR;                        /**< TCD Source Address, offset: 0x20020 */
  __IO uint16_t TCD2_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x20024 */
  __IO uint16_t TCD2_ATTR;                         /**< TCD Transfer Attributes, offset: 0x20026 */
  union {                                          /* offset: 0x20028 */
    __IO uint32_t TCD2_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x20028 */
    __IO uint32_t TCD2_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x20028 */
  } NBYTES2;
  __IO uint32_t TCD2_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2002C */
  __IO uint32_t TCD2_DADDR;                        /**< TCD Destination Address, offset: 0x20030 */
  __IO uint16_t TCD2_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x20034 */
  union {                                          /* offset: 0x20036 */
    __IO uint16_t TCD2_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x20036 */
    __IO uint16_t TCD2_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x20036 */
  } CITER2;
  __IO uint32_t TCD2_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x20038 */
  __IO uint16_t TCD2_CSR;                          /**< TCD Control and Status, offset: 0x2003C */
  union {                                          /* offset: 0x2003E */
    __IO uint16_t TCD2_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2003E */
    __IO uint16_t TCD2_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2003E */
  } BITER2;
  uint8_t RESERVED_17[4032];
  __IO uint32_t CH10_CSR;                          /**< Channel Control and Status, offset: 0x21000 */
  __IO uint32_t CH10_ES;                           /**< Channel Error Status, offset: 0x21004 */
  __IO uint32_t CH10_INT;                          /**< Channel Interrupt Status, offset: 0x21008 */
  __IO uint32_t CH10_SBR;                          /**< Channel System Bus, offset: 0x2100C */
  __IO uint32_t CH10_PRI;                          /**< Channel Priority, offset: 0x21010 */
  uint8_t RESERVED_18[12];
  __IO uint32_t TCD10_SADDR;                       /**< TCD Source Address, offset: 0x21020 */
  __IO uint16_t TCD10_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x21024 */
  __IO uint16_t TCD10_ATTR;                        /**< TCD Transfer Attributes, offset: 0x21026 */
  union {                                          /* offset: 0x21028 */
    __IO uint32_t TCD10_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x21028 */
    __IO uint32_t TCD10_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x21028 */
  } NBYTES10;
  __IO uint32_t TCD10_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2102C */
  __IO uint32_t TCD10_DADDR;                       /**< TCD Destination Address, offset: 0x21030 */
  __IO uint16_t TCD10_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x21034 */
  union {                                          /* offset: 0x21036 */
    __IO uint16_t TCD10_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x21036 */
    __IO uint16_t TCD10_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x21036 */
  } CITER10;
  __IO uint32_t TCD10_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x21038 */
  __IO uint16_t TCD10_CSR;                         /**< TCD Control and Status, offset: 0x2103C */
  union {                                          /* offset: 0x2103E */
    __IO uint16_t TCD10_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2103E */
    __IO uint16_t TCD10_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2103E */
  } BITER10;
  uint8_t RESERVED_19[4032];
  __IO uint32_t CH18_CSR;                          /**< Channel Control and Status, offset: 0x22000 */
  __IO uint32_t CH18_ES;                           /**< Channel Error Status, offset: 0x22004 */
  __IO uint32_t CH18_INT;                          /**< Channel Interrupt Status, offset: 0x22008 */
  __IO uint32_t CH18_SBR;                          /**< Channel System Bus, offset: 0x2200C */
  __IO uint32_t CH18_PRI;                          /**< Channel Priority, offset: 0x22010 */
  uint8_t RESERVED_20[12];
  __IO uint32_t TCD18_SADDR;                       /**< TCD Source Address, offset: 0x22020 */
  __IO uint16_t TCD18_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x22024 */
  __IO uint16_t TCD18_ATTR;                        /**< TCD Transfer Attributes, offset: 0x22026 */
  union {                                          /* offset: 0x22028 */
    __IO uint32_t TCD18_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x22028 */
    __IO uint32_t TCD18_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x22028 */
  } NBYTES18;
  __IO uint32_t TCD18_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2202C */
  __IO uint32_t TCD18_DADDR;                       /**< TCD Destination Address, offset: 0x22030 */
  __IO uint16_t TCD18_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x22034 */
  union {                                          /* offset: 0x22036 */
    __IO uint16_t TCD18_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x22036 */
    __IO uint16_t TCD18_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x22036 */
  } CITER18;
  __IO uint32_t TCD18_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x22038 */
  __IO uint16_t TCD18_CSR;                         /**< TCD Control and Status, offset: 0x2203C */
  union {                                          /* offset: 0x2203E */
    __IO uint16_t TCD18_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2203E */
    __IO uint16_t TCD18_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2203E */
  } BITER18;
  uint8_t RESERVED_21[4032];
  __IO uint32_t CH26_CSR;                          /**< Channel Control and Status, offset: 0x23000 */
  __IO uint32_t CH26_ES;                           /**< Channel Error Status, offset: 0x23004 */
  __IO uint32_t CH26_INT;                          /**< Channel Interrupt Status, offset: 0x23008 */
  __IO uint32_t CH26_SBR;                          /**< Channel System Bus, offset: 0x2300C */
  __IO uint32_t CH26_PRI;                          /**< Channel Priority, offset: 0x23010 */
  uint8_t RESERVED_22[12];
  __IO uint32_t TCD26_SADDR;                       /**< TCD Source Address, offset: 0x23020 */
  __IO uint16_t TCD26_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x23024 */
  __IO uint16_t TCD26_ATTR;                        /**< TCD Transfer Attributes, offset: 0x23026 */
  union {                                          /* offset: 0x23028 */
    __IO uint32_t TCD26_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x23028 */
    __IO uint32_t TCD26_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x23028 */
  } NBYTES26;
  __IO uint32_t TCD26_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x2302C */
  __IO uint32_t TCD26_DADDR;                       /**< TCD Destination Address, offset: 0x23030 */
  __IO uint16_t TCD26_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x23034 */
  union {                                          /* offset: 0x23036 */
    __IO uint16_t TCD26_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x23036 */
    __IO uint16_t TCD26_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x23036 */
  } CITER26;
  __IO uint32_t TCD26_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x23038 */
  __IO uint16_t TCD26_CSR;                         /**< TCD Control and Status, offset: 0x2303C */
  union {                                          /* offset: 0x2303E */
    __IO uint16_t TCD26_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x2303E */
    __IO uint16_t TCD26_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x2303E */
  } BITER26;
  uint8_t RESERVED_23[1232832];
  __IO uint32_t CH3_CSR;                           /**< Channel Control and Status, offset: 0x150000 */
  __IO uint32_t CH3_ES;                            /**< Channel Error Status, offset: 0x150004 */
  __IO uint32_t CH3_INT;                           /**< Channel Interrupt Status, offset: 0x150008 */
  __IO uint32_t CH3_SBR;                           /**< Channel System Bus, offset: 0x15000C */
  __IO uint32_t CH3_PRI;                           /**< Channel Priority, offset: 0x150010 */
  uint8_t RESERVED_24[12];
  __IO uint32_t TCD3_SADDR;                        /**< TCD Source Address, offset: 0x150020 */
  __IO uint16_t TCD3_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x150024 */
  __IO uint16_t TCD3_ATTR;                         /**< TCD Transfer Attributes, offset: 0x150026 */
  union {                                          /* offset: 0x150028 */
    __IO uint32_t TCD3_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x150028 */
    __IO uint32_t TCD3_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x150028 */
  } NBYTES3;
  __IO uint32_t TCD3_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15002C */
  __IO uint32_t TCD3_DADDR;                        /**< TCD Destination Address, offset: 0x150030 */
  __IO uint16_t TCD3_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x150034 */
  union {                                          /* offset: 0x150036 */
    __IO uint16_t TCD3_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x150036 */
    __IO uint16_t TCD3_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x150036 */
  } CITER3;
  __IO uint32_t TCD3_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x150038 */
  __IO uint16_t TCD3_CSR;                          /**< TCD Control and Status, offset: 0x15003C */
  union {                                          /* offset: 0x15003E */
    __IO uint16_t TCD3_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15003E */
    __IO uint16_t TCD3_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15003E */
  } BITER3;
  uint8_t RESERVED_25[4032];
  __IO uint32_t CH11_CSR;                          /**< Channel Control and Status, offset: 0x151000 */
  __IO uint32_t CH11_ES;                           /**< Channel Error Status, offset: 0x151004 */
  __IO uint32_t CH11_INT;                          /**< Channel Interrupt Status, offset: 0x151008 */
  __IO uint32_t CH11_SBR;                          /**< Channel System Bus, offset: 0x15100C */
  __IO uint32_t CH11_PRI;                          /**< Channel Priority, offset: 0x151010 */
  uint8_t RESERVED_26[12];
  __IO uint32_t TCD11_SADDR;                       /**< TCD Source Address, offset: 0x151020 */
  __IO uint16_t TCD11_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x151024 */
  __IO uint16_t TCD11_ATTR;                        /**< TCD Transfer Attributes, offset: 0x151026 */
  union {                                          /* offset: 0x151028 */
    __IO uint32_t TCD11_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x151028 */
    __IO uint32_t TCD11_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x151028 */
  } NBYTES11;
  __IO uint32_t TCD11_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15102C */
  __IO uint32_t TCD11_DADDR;                       /**< TCD Destination Address, offset: 0x151030 */
  __IO uint16_t TCD11_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x151034 */
  union {                                          /* offset: 0x151036 */
    __IO uint16_t TCD11_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x151036 */
    __IO uint16_t TCD11_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x151036 */
  } CITER11;
  __IO uint32_t TCD11_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x151038 */
  __IO uint16_t TCD11_CSR;                         /**< TCD Control and Status, offset: 0x15103C */
  union {                                          /* offset: 0x15103E */
    __IO uint16_t TCD11_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15103E */
    __IO uint16_t TCD11_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15103E */
  } BITER11;
  uint8_t RESERVED_27[4032];
  __IO uint32_t CH19_CSR;                          /**< Channel Control and Status, offset: 0x152000 */
  __IO uint32_t CH19_ES;                           /**< Channel Error Status, offset: 0x152004 */
  __IO uint32_t CH19_INT;                          /**< Channel Interrupt Status, offset: 0x152008 */
  __IO uint32_t CH19_SBR;                          /**< Channel System Bus, offset: 0x15200C */
  __IO uint32_t CH19_PRI;                          /**< Channel Priority, offset: 0x152010 */
  uint8_t RESERVED_28[12];
  __IO uint32_t TCD19_SADDR;                       /**< TCD Source Address, offset: 0x152020 */
  __IO uint16_t TCD19_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x152024 */
  __IO uint16_t TCD19_ATTR;                        /**< TCD Transfer Attributes, offset: 0x152026 */
  union {                                          /* offset: 0x152028 */
    __IO uint32_t TCD19_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x152028 */
    __IO uint32_t TCD19_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x152028 */
  } NBYTES19;
  __IO uint32_t TCD19_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15202C */
  __IO uint32_t TCD19_DADDR;                       /**< TCD Destination Address, offset: 0x152030 */
  __IO uint16_t TCD19_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x152034 */
  union {                                          /* offset: 0x152036 */
    __IO uint16_t TCD19_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x152036 */
    __IO uint16_t TCD19_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x152036 */
  } CITER19;
  __IO uint32_t TCD19_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x152038 */
  __IO uint16_t TCD19_CSR;                         /**< TCD Control and Status, offset: 0x15203C */
  union {                                          /* offset: 0x15203E */
    __IO uint16_t TCD19_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15203E */
    __IO uint16_t TCD19_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15203E */
  } BITER19;
  uint8_t RESERVED_29[4032];
  __IO uint32_t CH27_CSR;                          /**< Channel Control and Status, offset: 0x153000 */
  __IO uint32_t CH27_ES;                           /**< Channel Error Status, offset: 0x153004 */
  __IO uint32_t CH27_INT;                          /**< Channel Interrupt Status, offset: 0x153008 */
  __IO uint32_t CH27_SBR;                          /**< Channel System Bus, offset: 0x15300C */
  __IO uint32_t CH27_PRI;                          /**< Channel Priority, offset: 0x153010 */
  uint8_t RESERVED_30[12];
  __IO uint32_t TCD27_SADDR;                       /**< TCD Source Address, offset: 0x153020 */
  __IO uint16_t TCD27_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x153024 */
  __IO uint16_t TCD27_ATTR;                        /**< TCD Transfer Attributes, offset: 0x153026 */
  union {                                          /* offset: 0x153028 */
    __IO uint32_t TCD27_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x153028 */
    __IO uint32_t TCD27_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x153028 */
  } NBYTES27;
  __IO uint32_t TCD27_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x15302C */
  __IO uint32_t TCD27_DADDR;                       /**< TCD Destination Address, offset: 0x153030 */
  __IO uint16_t TCD27_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x153034 */
  union {                                          /* offset: 0x153036 */
    __IO uint16_t TCD27_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x153036 */
    __IO uint16_t TCD27_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x153036 */
  } CITER27;
  __IO uint32_t TCD27_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x153038 */
  __IO uint16_t TCD27_CSR;                         /**< TCD Control and Status, offset: 0x15303C */
  union {                                          /* offset: 0x15303E */
    __IO uint16_t TCD27_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x15303E */
    __IO uint16_t TCD27_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x15303E */
  } BITER27;
  uint8_t RESERVED_31[53184];
  __IO uint32_t CH4_CSR;                           /**< Channel Control and Status, offset: 0x160000 */
  __IO uint32_t CH4_ES;                            /**< Channel Error Status, offset: 0x160004 */
  __IO uint32_t CH4_INT;                           /**< Channel Interrupt Status, offset: 0x160008 */
  __IO uint32_t CH4_SBR;                           /**< Channel System Bus, offset: 0x16000C */
  __IO uint32_t CH4_PRI;                           /**< Channel Priority, offset: 0x160010 */
  uint8_t RESERVED_32[12];
  __IO uint32_t TCD4_SADDR;                        /**< TCD Source Address, offset: 0x160020 */
  __IO uint16_t TCD4_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x160024 */
  __IO uint16_t TCD4_ATTR;                         /**< TCD Transfer Attributes, offset: 0x160026 */
  union {                                          /* offset: 0x160028 */
    __IO uint32_t TCD4_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x160028 */
    __IO uint32_t TCD4_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x160028 */
  } NBYTES4;
  __IO uint32_t TCD4_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16002C */
  __IO uint32_t TCD4_DADDR;                        /**< TCD Destination Address, offset: 0x160030 */
  __IO uint16_t TCD4_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x160034 */
  union {                                          /* offset: 0x160036 */
    __IO uint16_t TCD4_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x160036 */
    __IO uint16_t TCD4_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x160036 */
  } CITER4;
  __IO uint32_t TCD4_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x160038 */
  __IO uint16_t TCD4_CSR;                          /**< TCD Control and Status, offset: 0x16003C */
  union {                                          /* offset: 0x16003E */
    __IO uint16_t TCD4_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16003E */
    __IO uint16_t TCD4_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16003E */
  } BITER4;
  uint8_t RESERVED_33[4032];
  __IO uint32_t CH12_CSR;                          /**< Channel Control and Status, offset: 0x161000 */
  __IO uint32_t CH12_ES;                           /**< Channel Error Status, offset: 0x161004 */
  __IO uint32_t CH12_INT;                          /**< Channel Interrupt Status, offset: 0x161008 */
  __IO uint32_t CH12_SBR;                          /**< Channel System Bus, offset: 0x16100C */
  __IO uint32_t CH12_PRI;                          /**< Channel Priority, offset: 0x161010 */
  uint8_t RESERVED_34[12];
  __IO uint32_t TCD12_SADDR;                       /**< TCD Source Address, offset: 0x161020 */
  __IO uint16_t TCD12_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x161024 */
  __IO uint16_t TCD12_ATTR;                        /**< TCD Transfer Attributes, offset: 0x161026 */
  union {                                          /* offset: 0x161028 */
    __IO uint32_t TCD12_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x161028 */
    __IO uint32_t TCD12_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x161028 */
  } NBYTES12;
  __IO uint32_t TCD12_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16102C */
  __IO uint32_t TCD12_DADDR;                       /**< TCD Destination Address, offset: 0x161030 */
  __IO uint16_t TCD12_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x161034 */
  union {                                          /* offset: 0x161036 */
    __IO uint16_t TCD12_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x161036 */
