rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
    __IO uint16_t TCD12_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x161036 */
  } CITER12;
  __IO uint32_t TCD12_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x161038 */
  __IO uint16_t TCD12_CSR;                         /**< TCD Control and Status, offset: 0x16103C */
  union {                                          /* offset: 0x16103E */
    __IO uint16_t TCD12_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16103E */
    __IO uint16_t TCD12_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16103E */
  } BITER12;
  uint8_t RESERVED_35[4032];
  __IO uint32_t CH20_CSR;                          /**< Channel Control and Status, offset: 0x162000 */
  __IO uint32_t CH20_ES;                           /**< Channel Error Status, offset: 0x162004 */
  __IO uint32_t CH20_INT;                          /**< Channel Interrupt Status, offset: 0x162008 */
  __IO uint32_t CH20_SBR;                          /**< Channel System Bus, offset: 0x16200C */
  __IO uint32_t CH20_PRI;                          /**< Channel Priority, offset: 0x162010 */
  uint8_t RESERVED_36[12];
  __IO uint32_t TCD20_SADDR;                       /**< TCD Source Address, offset: 0x162020 */
  __IO uint16_t TCD20_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x162024 */
  __IO uint16_t TCD20_ATTR;                        /**< TCD Transfer Attributes, offset: 0x162026 */
  union {                                          /* offset: 0x162028 */
    __IO uint32_t TCD20_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x162028 */
    __IO uint32_t TCD20_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x162028 */
  } NBYTES20;
  __IO uint32_t TCD20_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16202C */
  __IO uint32_t TCD20_DADDR;                       /**< TCD Destination Address, offset: 0x162030 */
  __IO uint16_t TCD20_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x162034 */
  union {                                          /* offset: 0x162036 */
    __IO uint16_t TCD20_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x162036 */
    __IO uint16_t TCD20_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x162036 */
  } CITER20;
  __IO uint32_t TCD20_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x162038 */
  __IO uint16_t TCD20_CSR;                         /**< TCD Control and Status, offset: 0x16203C */
  union {                                          /* offset: 0x16203E */
    __IO uint16_t TCD20_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16203E */
    __IO uint16_t TCD20_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16203E */
  } BITER20;
  uint8_t RESERVED_37[4032];
  __IO uint32_t CH28_CSR;                          /**< Channel Control and Status, offset: 0x163000 */
  __IO uint32_t CH28_ES;                           /**< Channel Error Status, offset: 0x163004 */
  __IO uint32_t CH28_INT;                          /**< Channel Interrupt Status, offset: 0x163008 */
  __IO uint32_t CH28_SBR;                          /**< Channel System Bus, offset: 0x16300C */
  __IO uint32_t CH28_PRI;                          /**< Channel Priority, offset: 0x163010 */
  uint8_t RESERVED_38[12];
  __IO uint32_t TCD28_SADDR;                       /**< TCD Source Address, offset: 0x163020 */
  __IO uint16_t TCD28_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x163024 */
  __IO uint16_t TCD28_ATTR;                        /**< TCD Transfer Attributes, offset: 0x163026 */
  union {                                          /* offset: 0x163028 */
    __IO uint32_t TCD28_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x163028 */
    __IO uint32_t TCD28_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x163028 */
  } NBYTES28;
  __IO uint32_t TCD28_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x16302C */
  __IO uint32_t TCD28_DADDR;                       /**< TCD Destination Address, offset: 0x163030 */
  __IO uint16_t TCD28_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x163034 */
  union {                                          /* offset: 0x163036 */
    __IO uint16_t TCD28_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x163036 */
    __IO uint16_t TCD28_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x163036 */
  } CITER28;
  __IO uint32_t TCD28_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x163038 */
  __IO uint16_t TCD28_CSR;                         /**< TCD Control and Status, offset: 0x16303C */
  union {                                          /* offset: 0x16303E */
    __IO uint16_t TCD28_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x16303E */
    __IO uint16_t TCD28_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x16303E */
  } BITER28;
  uint8_t RESERVED_39[53184];
  __IO uint32_t CH5_CSR;                           /**< Channel Control and Status, offset: 0x170000 */
  __IO uint32_t CH5_ES;                            /**< Channel Error Status, offset: 0x170004 */
  __IO uint32_t CH5_INT;                           /**< Channel Interrupt Status, offset: 0x170008 */
  __IO uint32_t CH5_SBR;                           /**< Channel System Bus, offset: 0x17000C */
  __IO uint32_t CH5_PRI;                           /**< Channel Priority, offset: 0x170010 */
  uint8_t RESERVED_40[12];
  __IO uint32_t TCD5_SADDR;                        /**< TCD Source Address, offset: 0x170020 */
  __IO uint16_t TCD5_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x170024 */
  __IO uint16_t TCD5_ATTR;                         /**< TCD Transfer Attributes, offset: 0x170026 */
  union {                                          /* offset: 0x170028 */
    __IO uint32_t TCD5_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x170028 */
    __IO uint32_t TCD5_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x170028 */
  } NBYTES5;
  __IO uint32_t TCD5_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17002C */
  __IO uint32_t TCD5_DADDR;                        /**< TCD Destination Address, offset: 0x170030 */
  __IO uint16_t TCD5_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x170034 */
  union {                                          /* offset: 0x170036 */
    __IO uint16_t TCD5_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x170036 */
    __IO uint16_t TCD5_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x170036 */
  } CITER5;
  __IO uint32_t TCD5_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x170038 */
  __IO uint16_t TCD5_CSR;                          /**< TCD Control and Status, offset: 0x17003C */
  union {                                          /* offset: 0x17003E */
    __IO uint16_t TCD5_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17003E */
    __IO uint16_t TCD5_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17003E */
  } BITER5;
  uint8_t RESERVED_41[4032];
  __IO uint32_t CH13_CSR;                          /**< Channel Control and Status, offset: 0x171000 */
  __IO uint32_t CH13_ES;                           /**< Channel Error Status, offset: 0x171004 */
  __IO uint32_t CH13_INT;                          /**< Channel Interrupt Status, offset: 0x171008 */
  __IO uint32_t CH13_SBR;                          /**< Channel System Bus, offset: 0x17100C */
  __IO uint32_t CH13_PRI;                          /**< Channel Priority, offset: 0x171010 */
  uint8_t RESERVED_42[12];
  __IO uint32_t TCD13_SADDR;                       /**< TCD Source Address, offset: 0x171020 */
  __IO uint16_t TCD13_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x171024 */
  __IO uint16_t TCD13_ATTR;                        /**< TCD Transfer Attributes, offset: 0x171026 */
  union {                                          /* offset: 0x171028 */
    __IO uint32_t TCD13_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x171028 */
    __IO uint32_t TCD13_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x171028 */
  } NBYTES13;
  __IO uint32_t TCD13_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17102C */
  __IO uint32_t TCD13_DADDR;                       /**< TCD Destination Address, offset: 0x171030 */
  __IO uint16_t TCD13_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x171034 */
  union {                                          /* offset: 0x171036 */
    __IO uint16_t TCD13_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x171036 */
    __IO uint16_t TCD13_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x171036 */
  } CITER13;
  __IO uint32_t TCD13_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x171038 */
  __IO uint16_t TCD13_CSR;                         /**< TCD Control and Status, offset: 0x17103C */
  union {                                          /* offset: 0x17103E */
    __IO uint16_t TCD13_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17103E */
    __IO uint16_t TCD13_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17103E */
  } BITER13;
  uint8_t RESERVED_43[4032];
  __IO uint32_t CH21_CSR;                          /**< Channel Control and Status, offset: 0x172000 */
  __IO uint32_t CH21_ES;                           /**< Channel Error Status, offset: 0x172004 */
  __IO uint32_t CH21_INT;                          /**< Channel Interrupt Status, offset: 0x172008 */
  __IO uint32_t CH21_SBR;                          /**< Channel System Bus, offset: 0x17200C */
  __IO uint32_t CH21_PRI;                          /**< Channel Priority, offset: 0x172010 */
  uint8_t RESERVED_44[12];
  __IO uint32_t TCD21_SADDR;                       /**< TCD Source Address, offset: 0x172020 */
  __IO uint16_t TCD21_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x172024 */
  __IO uint16_t TCD21_ATTR;                        /**< TCD Transfer Attributes, offset: 0x172026 */
  union {                                          /* offset: 0x172028 */
    __IO uint32_t TCD21_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x172028 */
    __IO uint32_t TCD21_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x172028 */
  } NBYTES21;
  __IO uint32_t TCD21_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17202C */
  __IO uint32_t TCD21_DADDR;                       /**< TCD Destination Address, offset: 0x172030 */
  __IO uint16_t TCD21_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x172034 */
  union {                                          /* offset: 0x172036 */
    __IO uint16_t TCD21_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x172036 */
    __IO uint16_t TCD21_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x172036 */
  } CITER21;
  __IO uint32_t TCD21_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x172038 */
  __IO uint16_t TCD21_CSR;                         /**< TCD Control and Status, offset: 0x17203C */
  union {                                          /* offset: 0x17203E */
    __IO uint16_t TCD21_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17203E */
    __IO uint16_t TCD21_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17203E */
  } BITER21;
  uint8_t RESERVED_45[4032];
  __IO uint32_t CH29_CSR;                          /**< Channel Control and Status, offset: 0x173000 */
  __IO uint32_t CH29_ES;                           /**< Channel Error Status, offset: 0x173004 */
  __IO uint32_t CH29_INT;                          /**< Channel Interrupt Status, offset: 0x173008 */
  __IO uint32_t CH29_SBR;                          /**< Channel System Bus, offset: 0x17300C */
  __IO uint32_t CH29_PRI;                          /**< Channel Priority, offset: 0x173010 */
  uint8_t RESERVED_46[12];
  __IO uint32_t TCD29_SADDR;                       /**< TCD Source Address, offset: 0x173020 */
  __IO uint16_t TCD29_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x173024 */
  __IO uint16_t TCD29_ATTR;                        /**< TCD Transfer Attributes, offset: 0x173026 */
  union {                                          /* offset: 0x173028 */
    __IO uint32_t TCD29_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x173028 */
    __IO uint32_t TCD29_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x173028 */
  } NBYTES29;
  __IO uint32_t TCD29_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x17302C */
  __IO uint32_t TCD29_DADDR;                       /**< TCD Destination Address, offset: 0x173030 */
  __IO uint16_t TCD29_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x173034 */
  union {                                          /* offset: 0x173036 */
    __IO uint16_t TCD29_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x173036 */
    __IO uint16_t TCD29_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x173036 */
  } CITER29;
  __IO uint32_t TCD29_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x173038 */
  __IO uint16_t TCD29_CSR;                         /**< TCD Control and Status, offset: 0x17303C */
  union {                                          /* offset: 0x17303E */
    __IO uint16_t TCD29_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x17303E */
    __IO uint16_t TCD29_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x17303E */
  } BITER29;
  uint8_t RESERVED_47[53184];
  __IO uint32_t CH6_CSR;                           /**< Channel Control and Status, offset: 0x180000 */
  __IO uint32_t CH6_ES;                            /**< Channel Error Status, offset: 0x180004 */
  __IO uint32_t CH6_INT;                           /**< Channel Interrupt Status, offset: 0x180008 */
  __IO uint32_t CH6_SBR;                           /**< Channel System Bus, offset: 0x18000C */
  __IO uint32_t CH6_PRI;                           /**< Channel Priority, offset: 0x180010 */
  uint8_t RESERVED_48[12];
  __IO uint32_t TCD6_SADDR;                        /**< TCD Source Address, offset: 0x180020 */
  __IO uint16_t TCD6_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x180024 */
  __IO uint16_t TCD6_ATTR;                         /**< TCD Transfer Attributes, offset: 0x180026 */
  union {                                          /* offset: 0x180028 */
    __IO uint32_t TCD6_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x180028 */
    __IO uint32_t TCD6_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x180028 */
  } NBYTES6;
  __IO uint32_t TCD6_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18002C */
  __IO uint32_t TCD6_DADDR;                        /**< TCD Destination Address, offset: 0x180030 */
  __IO uint16_t TCD6_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x180034 */
  union {                                          /* offset: 0x180036 */
    __IO uint16_t TCD6_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x180036 */
    __IO uint16_t TCD6_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x180036 */
  } CITER6;
  __IO uint32_t TCD6_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x180038 */
  __IO uint16_t TCD6_CSR;                          /**< TCD Control and Status, offset: 0x18003C */
  union {                                          /* offset: 0x18003E */
    __IO uint16_t TCD6_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18003E */
    __IO uint16_t TCD6_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18003E */
  } BITER6;
  uint8_t RESERVED_49[4032];
  __IO uint32_t CH14_CSR;                          /**< Channel Control and Status, offset: 0x181000 */
  __IO uint32_t CH14_ES;                           /**< Channel Error Status, offset: 0x181004 */
  __IO uint32_t CH14_INT;                          /**< Channel Interrupt Status, offset: 0x181008 */
  __IO uint32_t CH14_SBR;                          /**< Channel System Bus, offset: 0x18100C */
  __IO uint32_t CH14_PRI;                          /**< Channel Priority, offset: 0x181010 */
  uint8_t RESERVED_50[12];
  __IO uint32_t TCD14_SADDR;                       /**< TCD Source Address, offset: 0x181020 */
  __IO uint16_t TCD14_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x181024 */
  __IO uint16_t TCD14_ATTR;                        /**< TCD Transfer Attributes, offset: 0x181026 */
  union {                                          /* offset: 0x181028 */
    __IO uint32_t TCD14_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x181028 */
    __IO uint32_t TCD14_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x181028 */
  } NBYTES14;
  __IO uint32_t TCD14_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18102C */
  __IO uint32_t TCD14_DADDR;                       /**< TCD Destination Address, offset: 0x181030 */
  __IO uint16_t TCD14_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x181034 */
  union {                                          /* offset: 0x181036 */
    __IO uint16_t TCD14_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x181036 */
    __IO uint16_t TCD14_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x181036 */
  } CITER14;
  __IO uint32_t TCD14_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x181038 */
  __IO uint16_t TCD14_CSR;                         /**< TCD Control and Status, offset: 0x18103C */
  union {                                          /* offset: 0x18103E */
    __IO uint16_t TCD14_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18103E */
    __IO uint16_t TCD14_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18103E */
  } BITER14;
  uint8_t RESERVED_51[4032];
  __IO uint32_t CH22_CSR;                          /**< Channel Control and Status, offset: 0x182000 */
  __IO uint32_t CH22_ES;                           /**< Channel Error Status, offset: 0x182004 */
  __IO uint32_t CH22_INT;                          /**< Channel Interrupt Status, offset: 0x182008 */
  __IO uint32_t CH22_SBR;                          /**< Channel System Bus, offset: 0x18200C */
  __IO uint32_t CH22_PRI;                          /**< Channel Priority, offset: 0x182010 */
  uint8_t RESERVED_52[12];
  __IO uint32_t TCD22_SADDR;                       /**< TCD Source Address, offset: 0x182020 */
  __IO uint16_t TCD22_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x182024 */
  __IO uint16_t TCD22_ATTR;                        /**< TCD Transfer Attributes, offset: 0x182026 */
  union {                                          /* offset: 0x182028 */
    __IO uint32_t TCD22_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x182028 */
    __IO uint32_t TCD22_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x182028 */
  } NBYTES22;
  __IO uint32_t TCD22_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18202C */
  __IO uint32_t TCD22_DADDR;                       /**< TCD Destination Address, offset: 0x182030 */
  __IO uint16_t TCD22_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x182034 */
  union {                                          /* offset: 0x182036 */
    __IO uint16_t TCD22_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x182036 */
    __IO uint16_t TCD22_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x182036 */
  } CITER22;
  __IO uint32_t TCD22_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x182038 */
  __IO uint16_t TCD22_CSR;                         /**< TCD Control and Status, offset: 0x18203C */
  union {                                          /* offset: 0x18203E */
    __IO uint16_t TCD22_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18203E */
    __IO uint16_t TCD22_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18203E */
  } BITER22;
  uint8_t RESERVED_53[4032];
  __IO uint32_t CH30_CSR;                          /**< Channel Control and Status, offset: 0x183000 */
  __IO uint32_t CH30_ES;                           /**< Channel Error Status, offset: 0x183004 */
  __IO uint32_t CH30_INT;                          /**< Channel Interrupt Status, offset: 0x183008 */
