rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
  __IO uint32_t CH30_SBR;                          /**< Channel System Bus, offset: 0x18300C */
  __IO uint32_t CH30_PRI;                          /**< Channel Priority, offset: 0x183010 */
  uint8_t RESERVED_54[12];
  __IO uint32_t TCD30_SADDR;                       /**< TCD Source Address, offset: 0x183020 */
  __IO uint16_t TCD30_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x183024 */
  __IO uint16_t TCD30_ATTR;                        /**< TCD Transfer Attributes, offset: 0x183026 */
  union {                                          /* offset: 0x183028 */
    __IO uint32_t TCD30_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x183028 */
    __IO uint32_t TCD30_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x183028 */
  } NBYTES30;
  __IO uint32_t TCD30_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x18302C */
  __IO uint32_t TCD30_DADDR;                       /**< TCD Destination Address, offset: 0x183030 */
  __IO uint16_t TCD30_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x183034 */
  union {                                          /* offset: 0x183036 */
    __IO uint16_t TCD30_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x183036 */
    __IO uint16_t TCD30_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x183036 */
  } CITER30;
  __IO uint32_t TCD30_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x183038 */
  __IO uint16_t TCD30_CSR;                         /**< TCD Control and Status, offset: 0x18303C */
  union {                                          /* offset: 0x18303E */
    __IO uint16_t TCD30_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x18303E */
    __IO uint16_t TCD30_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x18303E */
  } BITER30;
  uint8_t RESERVED_55[53184];
  __IO uint32_t CH7_CSR;                           /**< Channel Control and Status, offset: 0x190000 */
  __IO uint32_t CH7_ES;                            /**< Channel Error Status, offset: 0x190004 */
  __IO uint32_t CH7_INT;                           /**< Channel Interrupt Status, offset: 0x190008 */
  __IO uint32_t CH7_SBR;                           /**< Channel System Bus, offset: 0x19000C */
  __IO uint32_t CH7_PRI;                           /**< Channel Priority, offset: 0x190010 */
  uint8_t RESERVED_56[12];
  __IO uint32_t TCD7_SADDR;                        /**< TCD Source Address, offset: 0x190020 */
  __IO uint16_t TCD7_SOFF;                         /**< TCD Signed Source Address Offset, offset: 0x190024 */
  __IO uint16_t TCD7_ATTR;                         /**< TCD Transfer Attributes, offset: 0x190026 */
  union {                                          /* offset: 0x190028 */
    __IO uint32_t TCD7_NBYTES_MLOFFNO;               /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x190028 */
    __IO uint32_t TCD7_NBYTES_MLOFFYES;              /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x190028 */
  } NBYTES7;
  __IO uint32_t TCD7_SLAST_SDA;                    /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19002C */
  __IO uint32_t TCD7_DADDR;                        /**< TCD Destination Address, offset: 0x190030 */
  __IO uint16_t TCD7_DOFF;                         /**< TCD Signed Destination Address Offset, offset: 0x190034 */
  union {                                          /* offset: 0x190036 */
    __IO uint16_t TCD7_CITER_ELINKNO;                /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x190036 */
    __IO uint16_t TCD7_CITER_ELINKYES;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x190036 */
  } CITER7;
  __IO uint32_t TCD7_DLAST_SGA;                    /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x190038 */
  __IO uint16_t TCD7_CSR;                          /**< TCD Control and Status, offset: 0x19003C */
  union {                                          /* offset: 0x19003E */
    __IO uint16_t TCD7_BITER_ELINKNO;                /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19003E */
    __IO uint16_t TCD7_BITER_ELINKYES;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19003E */
  } BITER7;
  uint8_t RESERVED_57[4032];
  __IO uint32_t CH15_CSR;                          /**< Channel Control and Status, offset: 0x191000 */
  __IO uint32_t CH15_ES;                           /**< Channel Error Status, offset: 0x191004 */
  __IO uint32_t CH15_INT;                          /**< Channel Interrupt Status, offset: 0x191008 */
  __IO uint32_t CH15_SBR;                          /**< Channel System Bus, offset: 0x19100C */
  __IO uint32_t CH15_PRI;                          /**< Channel Priority, offset: 0x191010 */
  uint8_t RESERVED_58[12];
  __IO uint32_t TCD15_SADDR;                       /**< TCD Source Address, offset: 0x191020 */
  __IO uint16_t TCD15_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x191024 */
  __IO uint16_t TCD15_ATTR;                        /**< TCD Transfer Attributes, offset: 0x191026 */
  union {                                          /* offset: 0x191028 */
    __IO uint32_t TCD15_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x191028 */
    __IO uint32_t TCD15_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x191028 */
  } NBYTES15;
  __IO uint32_t TCD15_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19102C */
  __IO uint32_t TCD15_DADDR;                       /**< TCD Destination Address, offset: 0x191030 */
  __IO uint16_t TCD15_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x191034 */
  union {                                          /* offset: 0x191036 */
    __IO uint16_t TCD15_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x191036 */
    __IO uint16_t TCD15_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x191036 */
  } CITER15;
  __IO uint32_t TCD15_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x191038 */
  __IO uint16_t TCD15_CSR;                         /**< TCD Control and Status, offset: 0x19103C */
  union {                                          /* offset: 0x19103E */
    __IO uint16_t TCD15_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19103E */
    __IO uint16_t TCD15_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19103E */
  } BITER15;
  uint8_t RESERVED_59[4032];
  __IO uint32_t CH23_CSR;                          /**< Channel Control and Status, offset: 0x192000 */
  __IO uint32_t CH23_ES;                           /**< Channel Error Status, offset: 0x192004 */
  __IO uint32_t CH23_INT;                          /**< Channel Interrupt Status, offset: 0x192008 */
  __IO uint32_t CH23_SBR;                          /**< Channel System Bus, offset: 0x19200C */
  __IO uint32_t CH23_PRI;                          /**< Channel Priority, offset: 0x192010 */
  uint8_t RESERVED_60[12];
  __IO uint32_t TCD23_SADDR;                       /**< TCD Source Address, offset: 0x192020 */
  __IO uint16_t TCD23_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x192024 */
  __IO uint16_t TCD23_ATTR;                        /**< TCD Transfer Attributes, offset: 0x192026 */
  union {                                          /* offset: 0x192028 */
    __IO uint32_t TCD23_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x192028 */
    __IO uint32_t TCD23_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x192028 */
  } NBYTES23;
  __IO uint32_t TCD23_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19202C */
  __IO uint32_t TCD23_DADDR;                       /**< TCD Destination Address, offset: 0x192030 */
  __IO uint16_t TCD23_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x192034 */
  union {                                          /* offset: 0x192036 */
    __IO uint16_t TCD23_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x192036 */
    __IO uint16_t TCD23_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x192036 */
  } CITER23;
  __IO uint32_t TCD23_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x192038 */
  __IO uint16_t TCD23_CSR;                         /**< TCD Control and Status, offset: 0x19203C */
  union {                                          /* offset: 0x19203E */
    __IO uint16_t TCD23_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19203E */
    __IO uint16_t TCD23_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19203E */
  } BITER23;
  uint8_t RESERVED_61[4032];
  __IO uint32_t CH31_CSR;                          /**< Channel Control and Status, offset: 0x193000 */
  __IO uint32_t CH31_ES;                           /**< Channel Error Status, offset: 0x193004 */
  __IO uint32_t CH31_INT;                          /**< Channel Interrupt Status, offset: 0x193008 */
  __IO uint32_t CH31_SBR;                          /**< Channel System Bus, offset: 0x19300C */
  __IO uint32_t CH31_PRI;                          /**< Channel Priority, offset: 0x193010 */
  uint8_t RESERVED_62[12];
  __IO uint32_t TCD31_SADDR;                       /**< TCD Source Address, offset: 0x193020 */
  __IO uint16_t TCD31_SOFF;                        /**< TCD Signed Source Address Offset, offset: 0x193024 */
  __IO uint16_t TCD31_ATTR;                        /**< TCD Transfer Attributes, offset: 0x193026 */
  union {                                          /* offset: 0x193028 */
    __IO uint32_t TCD31_NBYTES_MLOFFNO;              /**< TCD Transfer Size Without Minor Loop Offsets, offset: 0x193028 */
    __IO uint32_t TCD31_NBYTES_MLOFFYES;             /**< TCD Transfer Size with Minor Loop Offsets, offset: 0x193028 */
  } NBYTES31;
  __IO uint32_t TCD31_SLAST_SDA;                   /**< TCD Last Source Address Adjustment / Store DADDR Address, offset: 0x19302C */
  __IO uint32_t TCD31_DADDR;                       /**< TCD Destination Address, offset: 0x193030 */
  __IO uint16_t TCD31_DOFF;                        /**< TCD Signed Destination Address Offset, offset: 0x193034 */
  union {                                          /* offset: 0x193036 */
    __IO uint16_t TCD31_CITER_ELINKNO;               /**< TCD Current Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x193036 */
    __IO uint16_t TCD31_CITER_ELINKYES;              /**< TCD Current Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x193036 */
  } CITER31;
  __IO uint32_t TCD31_DLAST_SGA;                   /**< TCD Last Destination Address Adjustment / Scatter Gather Address, offset: 0x193038 */
  __IO uint16_t TCD31_CSR;                         /**< TCD Control and Status, offset: 0x19303C */
  union {                                          /* offset: 0x19303E */
    __IO uint16_t TCD31_BITER_ELINKNO;               /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled), offset: 0x19303E */
    __IO uint16_t TCD31_BITER_ELINKYES;              /**< TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled), offset: 0x19303E */
  } BITER31;
} FEED_DMA_TCD_Type, *FEED_DMA_TCD_MemMapPtr;

/** Number of instances of the FEED_DMA_TCD module. */
#define FEED_DMA_TCD_INSTANCE_COUNT              (1u)

/* FEED_DMA_TCD - Peripheral instance base addresses */
/** Peripheral FEED_DMA_TCD base address */
#define IP_FEED_DMA_TCD_BASE                     (0x403D1000u)
/** Peripheral FEED_DMA_TCD base pointer */
#define IP_FEED_DMA_TCD                          ((FEED_DMA_TCD_Type *)IP_FEED_DMA_TCD_BASE)
/** Array initializer of FEED_DMA_TCD peripheral base addresses */
#define IP_FEED_DMA_TCD_BASE_ADDRS               { IP_FEED_DMA_TCD_BASE }
/** Array initializer of FEED_DMA_TCD peripheral base pointers */
#define IP_FEED_DMA_TCD_BASE_PTRS                { IP_FEED_DMA_TCD }

/* ----------------------------------------------------------------------------
   -- FEED_DMA_TCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FEED_DMA_TCD_Register_Masks FEED_DMA_TCD Register Masks
 * @{
 */

/*! @name CH0_CSR - Channel Control and Status */
/*! @{ */

#define FEED_DMA_TCD_CH0_CSR_ERQ_MASK            (0x1U)
#define FEED_DMA_TCD_CH0_CSR_ERQ_SHIFT           (0U)
#define FEED_DMA_TCD_CH0_CSR_ERQ_WIDTH           (1U)
#define FEED_DMA_TCD_CH0_CSR_ERQ(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_CSR_ERQ_SHIFT)) & FEED_DMA_TCD_CH0_CSR_ERQ_MASK)

#define FEED_DMA_TCD_CH0_CSR_EARQ_MASK           (0x2U)
#define FEED_DMA_TCD_CH0_CSR_EARQ_SHIFT          (1U)
#define FEED_DMA_TCD_CH0_CSR_EARQ_WIDTH          (1U)
#define FEED_DMA_TCD_CH0_CSR_EARQ(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_CSR_EARQ_SHIFT)) & FEED_DMA_TCD_CH0_CSR_EARQ_MASK)

#define FEED_DMA_TCD_CH0_CSR_EEI_MASK            (0x4U)
#define FEED_DMA_TCD_CH0_CSR_EEI_SHIFT           (2U)
#define FEED_DMA_TCD_CH0_CSR_EEI_WIDTH           (1U)
#define FEED_DMA_TCD_CH0_CSR_EEI(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_CSR_EEI_SHIFT)) & FEED_DMA_TCD_CH0_CSR_EEI_MASK)

#define FEED_DMA_TCD_CH0_CSR_DONE_MASK           (0x40000000U)
#define FEED_DMA_TCD_CH0_CSR_DONE_SHIFT          (30U)
#define FEED_DMA_TCD_CH0_CSR_DONE_WIDTH          (1U)
#define FEED_DMA_TCD_CH0_CSR_DONE(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_CSR_DONE_SHIFT)) & FEED_DMA_TCD_CH0_CSR_DONE_MASK)

#define FEED_DMA_TCD_CH0_CSR_ACTIVE_MASK         (0x80000000U)
#define FEED_DMA_TCD_CH0_CSR_ACTIVE_SHIFT        (31U)
#define FEED_DMA_TCD_CH0_CSR_ACTIVE_WIDTH        (1U)
#define FEED_DMA_TCD_CH0_CSR_ACTIVE(x)           (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_CSR_ACTIVE_SHIFT)) & FEED_DMA_TCD_CH0_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH0_ES - Channel Error Status */
/*! @{ */

#define FEED_DMA_TCD_CH0_ES_DBE_MASK             (0x1U)
#define FEED_DMA_TCD_CH0_ES_DBE_SHIFT            (0U)
#define FEED_DMA_TCD_CH0_ES_DBE_WIDTH            (1U)
#define FEED_DMA_TCD_CH0_ES_DBE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_ES_DBE_SHIFT)) & FEED_DMA_TCD_CH0_ES_DBE_MASK)

#define FEED_DMA_TCD_CH0_ES_SBE_MASK             (0x2U)
#define FEED_DMA_TCD_CH0_ES_SBE_SHIFT            (1U)
#define FEED_DMA_TCD_CH0_ES_SBE_WIDTH            (1U)
#define FEED_DMA_TCD_CH0_ES_SBE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH0_ES_SBE_SHIFT)) & FEED_DMA_TCD_CH0_ES_SBE_MASK)

