rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_CH17_ES_DOE_MASK            (0x10U)
#define FEED_DMA_TCD_CH17_ES_DOE_SHIFT           (4U)
#define FEED_DMA_TCD_CH17_ES_DOE_WIDTH           (1U)
#define FEED_DMA_TCD_CH17_ES_DOE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_ES_DOE_SHIFT)) & FEED_DMA_TCD_CH17_ES_DOE_MASK)

#define FEED_DMA_TCD_CH17_ES_DAE_MASK            (0x20U)
#define FEED_DMA_TCD_CH17_ES_DAE_SHIFT           (5U)
#define FEED_DMA_TCD_CH17_ES_DAE_WIDTH           (1U)
#define FEED_DMA_TCD_CH17_ES_DAE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_ES_DAE_SHIFT)) & FEED_DMA_TCD_CH17_ES_DAE_MASK)

#define FEED_DMA_TCD_CH17_ES_SOE_MASK            (0x40U)
#define FEED_DMA_TCD_CH17_ES_SOE_SHIFT           (6U)
#define FEED_DMA_TCD_CH17_ES_SOE_WIDTH           (1U)
#define FEED_DMA_TCD_CH17_ES_SOE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_ES_SOE_SHIFT)) & FEED_DMA_TCD_CH17_ES_SOE_MASK)

#define FEED_DMA_TCD_CH17_ES_SAE_MASK            (0x80U)
#define FEED_DMA_TCD_CH17_ES_SAE_SHIFT           (7U)
#define FEED_DMA_TCD_CH17_ES_SAE_WIDTH           (1U)
#define FEED_DMA_TCD_CH17_ES_SAE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_ES_SAE_SHIFT)) & FEED_DMA_TCD_CH17_ES_SAE_MASK)

#define FEED_DMA_TCD_CH17_ES_ERR_MASK            (0x80000000U)
#define FEED_DMA_TCD_CH17_ES_ERR_SHIFT           (31U)
#define FEED_DMA_TCD_CH17_ES_ERR_WIDTH           (1U)
#define FEED_DMA_TCD_CH17_ES_ERR(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_ES_ERR_SHIFT)) & FEED_DMA_TCD_CH17_ES_ERR_MASK)
/*! @} */

/*! @name CH17_INT - Channel Interrupt Status */
/*! @{ */

#define FEED_DMA_TCD_CH17_INT_INT_MASK           (0x1U)
#define FEED_DMA_TCD_CH17_INT_INT_SHIFT          (0U)
#define FEED_DMA_TCD_CH17_INT_INT_WIDTH          (1U)
#define FEED_DMA_TCD_CH17_INT_INT(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_INT_INT_SHIFT)) & FEED_DMA_TCD_CH17_INT_INT_MASK)
/*! @} */

/*! @name CH17_SBR - Channel System Bus */
/*! @{ */

#define FEED_DMA_TCD_CH17_SBR_MID_MASK           (0x3FU)
#define FEED_DMA_TCD_CH17_SBR_MID_SHIFT          (0U)
#define FEED_DMA_TCD_CH17_SBR_MID_WIDTH          (6U)
#define FEED_DMA_TCD_CH17_SBR_MID(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_SBR_MID_SHIFT)) & FEED_DMA_TCD_CH17_SBR_MID_MASK)

#define FEED_DMA_TCD_CH17_SBR_PAL_MASK           (0x8000U)
#define FEED_DMA_TCD_CH17_SBR_PAL_SHIFT          (15U)
#define FEED_DMA_TCD_CH17_SBR_PAL_WIDTH          (1U)
#define FEED_DMA_TCD_CH17_SBR_PAL(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_SBR_PAL_SHIFT)) & FEED_DMA_TCD_CH17_SBR_PAL_MASK)

#define FEED_DMA_TCD_CH17_SBR_EMI_MASK           (0x10000U)
#define FEED_DMA_TCD_CH17_SBR_EMI_SHIFT          (16U)
#define FEED_DMA_TCD_CH17_SBR_EMI_WIDTH          (1U)
#define FEED_DMA_TCD_CH17_SBR_EMI(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_SBR_EMI_SHIFT)) & FEED_DMA_TCD_CH17_SBR_EMI_MASK)

#define FEED_DMA_TCD_CH17_SBR_ATTR_MASK          (0xE0000U)
#define FEED_DMA_TCD_CH17_SBR_ATTR_SHIFT         (17U)
#define FEED_DMA_TCD_CH17_SBR_ATTR_WIDTH         (3U)
#define FEED_DMA_TCD_CH17_SBR_ATTR(x)            (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_SBR_ATTR_SHIFT)) & FEED_DMA_TCD_CH17_SBR_ATTR_MASK)
/*! @} */

/*! @name CH17_PRI - Channel Priority */
/*! @{ */

#define FEED_DMA_TCD_CH17_PRI_APL_MASK           (0x7U)
#define FEED_DMA_TCD_CH17_PRI_APL_SHIFT          (0U)
#define FEED_DMA_TCD_CH17_PRI_APL_WIDTH          (3U)
#define FEED_DMA_TCD_CH17_PRI_APL(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_PRI_APL_SHIFT)) & FEED_DMA_TCD_CH17_PRI_APL_MASK)

#define FEED_DMA_TCD_CH17_PRI_DPA_MASK           (0x40000000U)
#define FEED_DMA_TCD_CH17_PRI_DPA_SHIFT          (30U)
#define FEED_DMA_TCD_CH17_PRI_DPA_WIDTH          (1U)
#define FEED_DMA_TCD_CH17_PRI_DPA(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_PRI_DPA_SHIFT)) & FEED_DMA_TCD_CH17_PRI_DPA_MASK)

#define FEED_DMA_TCD_CH17_PRI_ECP_MASK           (0x80000000U)
#define FEED_DMA_TCD_CH17_PRI_ECP_SHIFT          (31U)
#define FEED_DMA_TCD_CH17_PRI_ECP_WIDTH          (1U)
#define FEED_DMA_TCD_CH17_PRI_ECP(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH17_PRI_ECP_SHIFT)) & FEED_DMA_TCD_CH17_PRI_ECP_MASK)
/*! @} */

/*! @name TCD17_SADDR - TCD Source Address */
/*! @{ */

#define FEED_DMA_TCD_TCD17_SADDR_SADDR_MASK      (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD17_SADDR_SADDR_SHIFT     (0U)
#define FEED_DMA_TCD_TCD17_SADDR_SADDR_WIDTH     (32U)
#define FEED_DMA_TCD_TCD17_SADDR_SADDR(x)        (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD17_SADDR_SADDR_SHIFT)) & FEED_DMA_TCD_TCD17_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD17_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define FEED_DMA_TCD_TCD17_SOFF_SOFF_MASK        (0xFFFFU)
#define FEED_DMA_TCD_TCD17_SOFF_SOFF_SHIFT       (0U)
#define FEED_DMA_TCD_TCD17_SOFF_SOFF_WIDTH       (16U)
#define FEED_DMA_TCD_TCD17_SOFF_SOFF(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD17_SOFF_SOFF_SHIFT)) & FEED_DMA_TCD_TCD17_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD17_ATTR - TCD Transfer Attributes */
/*! @{ */

#define FEED_DMA_TCD_TCD17_ATTR_DSIZE_MASK       (0x7U)
#define FEED_DMA_TCD_TCD17_ATTR_DSIZE_SHIFT      (0U)
#define FEED_DMA_TCD_TCD17_ATTR_DSIZE_WIDTH      (3U)
#define FEED_DMA_TCD_TCD17_ATTR_DSIZE(x)         (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD17_ATTR_DSIZE_SHIFT)) & FEED_DMA_TCD_TCD17_ATTR_DSIZE_MASK)

#define FEED_DMA_TCD_TCD17_ATTR_DMOD_MASK        (0xF8U)
#define FEED_DMA_TCD_TCD17_ATTR_DMOD_SHIFT       (3U)
#define FEED_DMA_TCD_TCD17_ATTR_DMOD_WIDTH       (5U)
#define FEED_DMA_TCD_TCD17_ATTR_DMOD(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD17_ATTR_DMOD_SHIFT)) & FEED_DMA_TCD_TCD17_ATTR_DMOD_MASK)

#define FEED_DMA_TCD_TCD17_ATTR_SSIZE_MASK       (0x700U)
#define FEED_DMA_TCD_TCD17_ATTR_SSIZE_SHIFT      (8U)
#define FEED_DMA_TCD_TCD17_ATTR_SSIZE_WIDTH      (3U)
#define FEED_DMA_TCD_TCD17_ATTR_SSIZE(x)         (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD17_ATTR_SSIZE_SHIFT)) & FEED_DMA_TCD_TCD17_ATTR_SSIZE_MASK)

#define FEED_DMA_TCD_TCD17_ATTR_SMOD_MASK        (0xF800U)
#define FEED_DMA_TCD_TCD17_ATTR_SMOD_SHIFT       (11U)
#define FEED_DMA_TCD_TCD17_ATTR_SMOD_WIDTH       (5U)
#define FEED_DMA_TCD_TCD17_ATTR_SMOD(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD17_ATTR_SMOD_SHIFT)) & FEED_DMA_TCD_TCD17_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD17_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_NBYTES_MASK)

#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_DMLOE_MASK)

#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD17_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD17_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD17_NBYTES_MLOFFYES_NBYTES_MASK)

