rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_CH3_CSR_EEI_MASK            (0x4U)
#define FEED_DMA_TCD_CH3_CSR_EEI_SHIFT           (2U)
#define FEED_DMA_TCD_CH3_CSR_EEI_WIDTH           (1U)
#define FEED_DMA_TCD_CH3_CSR_EEI(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_CSR_EEI_SHIFT)) & FEED_DMA_TCD_CH3_CSR_EEI_MASK)

#define FEED_DMA_TCD_CH3_CSR_DONE_MASK           (0x40000000U)
#define FEED_DMA_TCD_CH3_CSR_DONE_SHIFT          (30U)
#define FEED_DMA_TCD_CH3_CSR_DONE_WIDTH          (1U)
#define FEED_DMA_TCD_CH3_CSR_DONE(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_CSR_DONE_SHIFT)) & FEED_DMA_TCD_CH3_CSR_DONE_MASK)

#define FEED_DMA_TCD_CH3_CSR_ACTIVE_MASK         (0x80000000U)
#define FEED_DMA_TCD_CH3_CSR_ACTIVE_SHIFT        (31U)
#define FEED_DMA_TCD_CH3_CSR_ACTIVE_WIDTH        (1U)
#define FEED_DMA_TCD_CH3_CSR_ACTIVE(x)           (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_CSR_ACTIVE_SHIFT)) & FEED_DMA_TCD_CH3_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH3_ES - Channel Error Status */
/*! @{ */

#define FEED_DMA_TCD_CH3_ES_DBE_MASK             (0x1U)
#define FEED_DMA_TCD_CH3_ES_DBE_SHIFT            (0U)
#define FEED_DMA_TCD_CH3_ES_DBE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_DBE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_DBE_SHIFT)) & FEED_DMA_TCD_CH3_ES_DBE_MASK)

#define FEED_DMA_TCD_CH3_ES_SBE_MASK             (0x2U)
#define FEED_DMA_TCD_CH3_ES_SBE_SHIFT            (1U)
#define FEED_DMA_TCD_CH3_ES_SBE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_SBE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_SBE_SHIFT)) & FEED_DMA_TCD_CH3_ES_SBE_MASK)

#define FEED_DMA_TCD_CH3_ES_SGE_MASK             (0x4U)
#define FEED_DMA_TCD_CH3_ES_SGE_SHIFT            (2U)
#define FEED_DMA_TCD_CH3_ES_SGE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_SGE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_SGE_SHIFT)) & FEED_DMA_TCD_CH3_ES_SGE_MASK)

#define FEED_DMA_TCD_CH3_ES_NCE_MASK             (0x8U)
#define FEED_DMA_TCD_CH3_ES_NCE_SHIFT            (3U)
#define FEED_DMA_TCD_CH3_ES_NCE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_NCE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_NCE_SHIFT)) & FEED_DMA_TCD_CH3_ES_NCE_MASK)

#define FEED_DMA_TCD_CH3_ES_DOE_MASK             (0x10U)
#define FEED_DMA_TCD_CH3_ES_DOE_SHIFT            (4U)
#define FEED_DMA_TCD_CH3_ES_DOE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_DOE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_DOE_SHIFT)) & FEED_DMA_TCD_CH3_ES_DOE_MASK)

#define FEED_DMA_TCD_CH3_ES_DAE_MASK             (0x20U)
#define FEED_DMA_TCD_CH3_ES_DAE_SHIFT            (5U)
#define FEED_DMA_TCD_CH3_ES_DAE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_DAE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_DAE_SHIFT)) & FEED_DMA_TCD_CH3_ES_DAE_MASK)

#define FEED_DMA_TCD_CH3_ES_SOE_MASK             (0x40U)
#define FEED_DMA_TCD_CH3_ES_SOE_SHIFT            (6U)
#define FEED_DMA_TCD_CH3_ES_SOE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_SOE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_SOE_SHIFT)) & FEED_DMA_TCD_CH3_ES_SOE_MASK)

#define FEED_DMA_TCD_CH3_ES_SAE_MASK             (0x80U)
#define FEED_DMA_TCD_CH3_ES_SAE_SHIFT            (7U)
#define FEED_DMA_TCD_CH3_ES_SAE_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_SAE(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_SAE_SHIFT)) & FEED_DMA_TCD_CH3_ES_SAE_MASK)

#define FEED_DMA_TCD_CH3_ES_ERR_MASK             (0x80000000U)
#define FEED_DMA_TCD_CH3_ES_ERR_SHIFT            (31U)
#define FEED_DMA_TCD_CH3_ES_ERR_WIDTH            (1U)
#define FEED_DMA_TCD_CH3_ES_ERR(x)               (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_ES_ERR_SHIFT)) & FEED_DMA_TCD_CH3_ES_ERR_MASK)
/*! @} */

/*! @name CH3_INT - Channel Interrupt Status */
/*! @{ */

#define FEED_DMA_TCD_CH3_INT_INT_MASK            (0x1U)
#define FEED_DMA_TCD_CH3_INT_INT_SHIFT           (0U)
#define FEED_DMA_TCD_CH3_INT_INT_WIDTH           (1U)
#define FEED_DMA_TCD_CH3_INT_INT(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_INT_INT_SHIFT)) & FEED_DMA_TCD_CH3_INT_INT_MASK)
/*! @} */

/*! @name CH3_SBR - Channel System Bus */
/*! @{ */

#define FEED_DMA_TCD_CH3_SBR_MID_MASK            (0x3FU)
#define FEED_DMA_TCD_CH3_SBR_MID_SHIFT           (0U)
#define FEED_DMA_TCD_CH3_SBR_MID_WIDTH           (6U)
#define FEED_DMA_TCD_CH3_SBR_MID(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_SBR_MID_SHIFT)) & FEED_DMA_TCD_CH3_SBR_MID_MASK)

#define FEED_DMA_TCD_CH3_SBR_PAL_MASK            (0x8000U)
#define FEED_DMA_TCD_CH3_SBR_PAL_SHIFT           (15U)
#define FEED_DMA_TCD_CH3_SBR_PAL_WIDTH           (1U)
#define FEED_DMA_TCD_CH3_SBR_PAL(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_SBR_PAL_SHIFT)) & FEED_DMA_TCD_CH3_SBR_PAL_MASK)

#define FEED_DMA_TCD_CH3_SBR_EMI_MASK            (0x10000U)
#define FEED_DMA_TCD_CH3_SBR_EMI_SHIFT           (16U)
#define FEED_DMA_TCD_CH3_SBR_EMI_WIDTH           (1U)
#define FEED_DMA_TCD_CH3_SBR_EMI(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_SBR_EMI_SHIFT)) & FEED_DMA_TCD_CH3_SBR_EMI_MASK)

#define FEED_DMA_TCD_CH3_SBR_ATTR_MASK           (0xE0000U)
#define FEED_DMA_TCD_CH3_SBR_ATTR_SHIFT          (17U)
#define FEED_DMA_TCD_CH3_SBR_ATTR_WIDTH          (3U)
#define FEED_DMA_TCD_CH3_SBR_ATTR(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_SBR_ATTR_SHIFT)) & FEED_DMA_TCD_CH3_SBR_ATTR_MASK)
/*! @} */

/*! @name CH3_PRI - Channel Priority */
/*! @{ */

#define FEED_DMA_TCD_CH3_PRI_APL_MASK            (0x7U)
#define FEED_DMA_TCD_CH3_PRI_APL_SHIFT           (0U)
#define FEED_DMA_TCD_CH3_PRI_APL_WIDTH           (3U)
#define FEED_DMA_TCD_CH3_PRI_APL(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_PRI_APL_SHIFT)) & FEED_DMA_TCD_CH3_PRI_APL_MASK)

#define FEED_DMA_TCD_CH3_PRI_DPA_MASK            (0x40000000U)
#define FEED_DMA_TCD_CH3_PRI_DPA_SHIFT           (30U)
#define FEED_DMA_TCD_CH3_PRI_DPA_WIDTH           (1U)
#define FEED_DMA_TCD_CH3_PRI_DPA(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH3_PRI_DPA_SHIFT)) & FEED_DMA_TCD_CH3_PRI_DPA_MASK)

