rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK_SHIFT)) & FEED_DMA_TCD_TCD11_BITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name CH19_CSR - Channel Control and Status */
/*! @{ */

#define FEED_DMA_TCD_CH19_CSR_ERQ_MASK           (0x1U)
#define FEED_DMA_TCD_CH19_CSR_ERQ_SHIFT          (0U)
#define FEED_DMA_TCD_CH19_CSR_ERQ_WIDTH          (1U)
#define FEED_DMA_TCD_CH19_CSR_ERQ(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_CSR_ERQ_SHIFT)) & FEED_DMA_TCD_CH19_CSR_ERQ_MASK)

#define FEED_DMA_TCD_CH19_CSR_EARQ_MASK          (0x2U)
#define FEED_DMA_TCD_CH19_CSR_EARQ_SHIFT         (1U)
#define FEED_DMA_TCD_CH19_CSR_EARQ_WIDTH         (1U)
#define FEED_DMA_TCD_CH19_CSR_EARQ(x)            (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_CSR_EARQ_SHIFT)) & FEED_DMA_TCD_CH19_CSR_EARQ_MASK)

#define FEED_DMA_TCD_CH19_CSR_EEI_MASK           (0x4U)
#define FEED_DMA_TCD_CH19_CSR_EEI_SHIFT          (2U)
#define FEED_DMA_TCD_CH19_CSR_EEI_WIDTH          (1U)
#define FEED_DMA_TCD_CH19_CSR_EEI(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_CSR_EEI_SHIFT)) & FEED_DMA_TCD_CH19_CSR_EEI_MASK)

#define FEED_DMA_TCD_CH19_CSR_DONE_MASK          (0x40000000U)
#define FEED_DMA_TCD_CH19_CSR_DONE_SHIFT         (30U)
#define FEED_DMA_TCD_CH19_CSR_DONE_WIDTH         (1U)
#define FEED_DMA_TCD_CH19_CSR_DONE(x)            (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_CSR_DONE_SHIFT)) & FEED_DMA_TCD_CH19_CSR_DONE_MASK)

#define FEED_DMA_TCD_CH19_CSR_ACTIVE_MASK        (0x80000000U)
#define FEED_DMA_TCD_CH19_CSR_ACTIVE_SHIFT       (31U)
#define FEED_DMA_TCD_CH19_CSR_ACTIVE_WIDTH       (1U)
#define FEED_DMA_TCD_CH19_CSR_ACTIVE(x)          (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_CSR_ACTIVE_SHIFT)) & FEED_DMA_TCD_CH19_CSR_ACTIVE_MASK)
/*! @} */

/*! @name CH19_ES - Channel Error Status */
/*! @{ */

#define FEED_DMA_TCD_CH19_ES_DBE_MASK            (0x1U)
#define FEED_DMA_TCD_CH19_ES_DBE_SHIFT           (0U)
#define FEED_DMA_TCD_CH19_ES_DBE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_DBE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_DBE_SHIFT)) & FEED_DMA_TCD_CH19_ES_DBE_MASK)

#define FEED_DMA_TCD_CH19_ES_SBE_MASK            (0x2U)
#define FEED_DMA_TCD_CH19_ES_SBE_SHIFT           (1U)
#define FEED_DMA_TCD_CH19_ES_SBE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_SBE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_SBE_SHIFT)) & FEED_DMA_TCD_CH19_ES_SBE_MASK)

#define FEED_DMA_TCD_CH19_ES_SGE_MASK            (0x4U)
#define FEED_DMA_TCD_CH19_ES_SGE_SHIFT           (2U)
#define FEED_DMA_TCD_CH19_ES_SGE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_SGE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_SGE_SHIFT)) & FEED_DMA_TCD_CH19_ES_SGE_MASK)

#define FEED_DMA_TCD_CH19_ES_NCE_MASK            (0x8U)
#define FEED_DMA_TCD_CH19_ES_NCE_SHIFT           (3U)
#define FEED_DMA_TCD_CH19_ES_NCE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_NCE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_NCE_SHIFT)) & FEED_DMA_TCD_CH19_ES_NCE_MASK)

#define FEED_DMA_TCD_CH19_ES_DOE_MASK            (0x10U)
#define FEED_DMA_TCD_CH19_ES_DOE_SHIFT           (4U)
#define FEED_DMA_TCD_CH19_ES_DOE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_DOE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_DOE_SHIFT)) & FEED_DMA_TCD_CH19_ES_DOE_MASK)

#define FEED_DMA_TCD_CH19_ES_DAE_MASK            (0x20U)
#define FEED_DMA_TCD_CH19_ES_DAE_SHIFT           (5U)
#define FEED_DMA_TCD_CH19_ES_DAE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_DAE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_DAE_SHIFT)) & FEED_DMA_TCD_CH19_ES_DAE_MASK)

#define FEED_DMA_TCD_CH19_ES_SOE_MASK            (0x40U)
#define FEED_DMA_TCD_CH19_ES_SOE_SHIFT           (6U)
#define FEED_DMA_TCD_CH19_ES_SOE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_SOE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_SOE_SHIFT)) & FEED_DMA_TCD_CH19_ES_SOE_MASK)

#define FEED_DMA_TCD_CH19_ES_SAE_MASK            (0x80U)
#define FEED_DMA_TCD_CH19_ES_SAE_SHIFT           (7U)
#define FEED_DMA_TCD_CH19_ES_SAE_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_SAE(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_SAE_SHIFT)) & FEED_DMA_TCD_CH19_ES_SAE_MASK)

#define FEED_DMA_TCD_CH19_ES_ERR_MASK            (0x80000000U)
#define FEED_DMA_TCD_CH19_ES_ERR_SHIFT           (31U)
#define FEED_DMA_TCD_CH19_ES_ERR_WIDTH           (1U)
#define FEED_DMA_TCD_CH19_ES_ERR(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_ES_ERR_SHIFT)) & FEED_DMA_TCD_CH19_ES_ERR_MASK)
/*! @} */

/*! @name CH19_INT - Channel Interrupt Status */
/*! @{ */

#define FEED_DMA_TCD_CH19_INT_INT_MASK           (0x1U)
#define FEED_DMA_TCD_CH19_INT_INT_SHIFT          (0U)
#define FEED_DMA_TCD_CH19_INT_INT_WIDTH          (1U)
#define FEED_DMA_TCD_CH19_INT_INT(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_INT_INT_SHIFT)) & FEED_DMA_TCD_CH19_INT_INT_MASK)
/*! @} */

/*! @name CH19_SBR - Channel System Bus */
/*! @{ */

#define FEED_DMA_TCD_CH19_SBR_MID_MASK           (0x3FU)
#define FEED_DMA_TCD_CH19_SBR_MID_SHIFT          (0U)
#define FEED_DMA_TCD_CH19_SBR_MID_WIDTH          (6U)
#define FEED_DMA_TCD_CH19_SBR_MID(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_SBR_MID_SHIFT)) & FEED_DMA_TCD_CH19_SBR_MID_MASK)

#define FEED_DMA_TCD_CH19_SBR_PAL_MASK           (0x8000U)
#define FEED_DMA_TCD_CH19_SBR_PAL_SHIFT          (15U)
#define FEED_DMA_TCD_CH19_SBR_PAL_WIDTH          (1U)
#define FEED_DMA_TCD_CH19_SBR_PAL(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_SBR_PAL_SHIFT)) & FEED_DMA_TCD_CH19_SBR_PAL_MASK)

#define FEED_DMA_TCD_CH19_SBR_EMI_MASK           (0x10000U)
#define FEED_DMA_TCD_CH19_SBR_EMI_SHIFT          (16U)
#define FEED_DMA_TCD_CH19_SBR_EMI_WIDTH          (1U)
#define FEED_DMA_TCD_CH19_SBR_EMI(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH19_SBR_EMI_SHIFT)) & FEED_DMA_TCD_CH19_SBR_EMI_MASK)

