rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_CH4_SBR_MID_MASK            (0x3FU)
#define FEED_DMA_TCD_CH4_SBR_MID_SHIFT           (0U)
#define FEED_DMA_TCD_CH4_SBR_MID_WIDTH           (6U)
#define FEED_DMA_TCD_CH4_SBR_MID(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_SBR_MID_SHIFT)) & FEED_DMA_TCD_CH4_SBR_MID_MASK)

#define FEED_DMA_TCD_CH4_SBR_PAL_MASK            (0x8000U)
#define FEED_DMA_TCD_CH4_SBR_PAL_SHIFT           (15U)
#define FEED_DMA_TCD_CH4_SBR_PAL_WIDTH           (1U)
#define FEED_DMA_TCD_CH4_SBR_PAL(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_SBR_PAL_SHIFT)) & FEED_DMA_TCD_CH4_SBR_PAL_MASK)

#define FEED_DMA_TCD_CH4_SBR_EMI_MASK            (0x10000U)
#define FEED_DMA_TCD_CH4_SBR_EMI_SHIFT           (16U)
#define FEED_DMA_TCD_CH4_SBR_EMI_WIDTH           (1U)
#define FEED_DMA_TCD_CH4_SBR_EMI(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_SBR_EMI_SHIFT)) & FEED_DMA_TCD_CH4_SBR_EMI_MASK)

#define FEED_DMA_TCD_CH4_SBR_ATTR_MASK           (0xE0000U)
#define FEED_DMA_TCD_CH4_SBR_ATTR_SHIFT          (17U)
#define FEED_DMA_TCD_CH4_SBR_ATTR_WIDTH          (3U)
#define FEED_DMA_TCD_CH4_SBR_ATTR(x)             (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_SBR_ATTR_SHIFT)) & FEED_DMA_TCD_CH4_SBR_ATTR_MASK)
/*! @} */

/*! @name CH4_PRI - Channel Priority */
/*! @{ */

#define FEED_DMA_TCD_CH4_PRI_APL_MASK            (0x7U)
#define FEED_DMA_TCD_CH4_PRI_APL_SHIFT           (0U)
#define FEED_DMA_TCD_CH4_PRI_APL_WIDTH           (3U)
#define FEED_DMA_TCD_CH4_PRI_APL(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_PRI_APL_SHIFT)) & FEED_DMA_TCD_CH4_PRI_APL_MASK)

#define FEED_DMA_TCD_CH4_PRI_DPA_MASK            (0x40000000U)
#define FEED_DMA_TCD_CH4_PRI_DPA_SHIFT           (30U)
#define FEED_DMA_TCD_CH4_PRI_DPA_WIDTH           (1U)
#define FEED_DMA_TCD_CH4_PRI_DPA(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_PRI_DPA_SHIFT)) & FEED_DMA_TCD_CH4_PRI_DPA_MASK)

#define FEED_DMA_TCD_CH4_PRI_ECP_MASK            (0x80000000U)
#define FEED_DMA_TCD_CH4_PRI_ECP_SHIFT           (31U)
#define FEED_DMA_TCD_CH4_PRI_ECP_WIDTH           (1U)
#define FEED_DMA_TCD_CH4_PRI_ECP(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH4_PRI_ECP_SHIFT)) & FEED_DMA_TCD_CH4_PRI_ECP_MASK)
/*! @} */

/*! @name TCD4_SADDR - TCD Source Address */
/*! @{ */

#define FEED_DMA_TCD_TCD4_SADDR_SADDR_MASK       (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD4_SADDR_SADDR_SHIFT      (0U)
#define FEED_DMA_TCD_TCD4_SADDR_SADDR_WIDTH      (32U)
#define FEED_DMA_TCD_TCD4_SADDR_SADDR(x)         (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_SADDR_SADDR_SHIFT)) & FEED_DMA_TCD_TCD4_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD4_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define FEED_DMA_TCD_TCD4_SOFF_SOFF_MASK         (0xFFFFU)
#define FEED_DMA_TCD_TCD4_SOFF_SOFF_SHIFT        (0U)
#define FEED_DMA_TCD_TCD4_SOFF_SOFF_WIDTH        (16U)
#define FEED_DMA_TCD_TCD4_SOFF_SOFF(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD4_SOFF_SOFF_SHIFT)) & FEED_DMA_TCD_TCD4_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD4_ATTR - TCD Transfer Attributes */
/*! @{ */

#define FEED_DMA_TCD_TCD4_ATTR_DSIZE_MASK        (0x7U)
#define FEED_DMA_TCD_TCD4_ATTR_DSIZE_SHIFT       (0U)
#define FEED_DMA_TCD_TCD4_ATTR_DSIZE_WIDTH       (3U)
#define FEED_DMA_TCD_TCD4_ATTR_DSIZE(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD4_ATTR_DSIZE_SHIFT)) & FEED_DMA_TCD_TCD4_ATTR_DSIZE_MASK)

#define FEED_DMA_TCD_TCD4_ATTR_DMOD_MASK         (0xF8U)
#define FEED_DMA_TCD_TCD4_ATTR_DMOD_SHIFT        (3U)
#define FEED_DMA_TCD_TCD4_ATTR_DMOD_WIDTH        (5U)
#define FEED_DMA_TCD_TCD4_ATTR_DMOD(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD4_ATTR_DMOD_SHIFT)) & FEED_DMA_TCD_TCD4_ATTR_DMOD_MASK)

#define FEED_DMA_TCD_TCD4_ATTR_SSIZE_MASK        (0x700U)
#define FEED_DMA_TCD_TCD4_ATTR_SSIZE_SHIFT       (8U)
#define FEED_DMA_TCD_TCD4_ATTR_SSIZE_WIDTH       (3U)
#define FEED_DMA_TCD_TCD4_ATTR_SSIZE(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD4_ATTR_SSIZE_SHIFT)) & FEED_DMA_TCD_TCD4_ATTR_SSIZE_MASK)

#define FEED_DMA_TCD_TCD4_ATTR_SMOD_MASK         (0xF800U)
#define FEED_DMA_TCD_TCD4_ATTR_SMOD_SHIFT        (11U)
#define FEED_DMA_TCD_TCD4_ATTR_SMOD_WIDTH        (5U)
#define FEED_DMA_TCD_TCD4_ATTR_SMOD(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD4_ATTR_SMOD_SHIFT)) & FEED_DMA_TCD_TCD4_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD4_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_NBYTES_MASK)

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_DMLOE_MASK)

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD4_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_NBYTES_MASK)

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_MLOFF_MASK)

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_DMLOE_MASK)

#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD4_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

