rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER_WIDTH (15U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER_SHIFT)) & FEED_DMA_TCD_TCD12_CITER_ELINKNO_CITER_MASK)

#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK_SHIFT)) & FEED_DMA_TCD_TCD12_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD12_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER_WIDTH (9U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER_SHIFT)) & FEED_DMA_TCD_TCD12_CITER_ELINKYES_CITER_MASK)

#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_SHIFT)) & FEED_DMA_TCD_TCD12_CITER_ELINKYES_LINKCH_MASK)

#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_SHIFT)) & FEED_DMA_TCD_TCD12_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD12_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_SHIFT)) & FEED_DMA_TCD_TCD12_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD12_CSR - TCD Control and Status */
/*! @{ */

#define FEED_DMA_TCD_TCD12_CSR_START_MASK        (0x1U)
#define FEED_DMA_TCD_TCD12_CSR_START_SHIFT       (0U)
#define FEED_DMA_TCD_TCD12_CSR_START_WIDTH       (1U)
#define FEED_DMA_TCD_TCD12_CSR_START(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_START_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_START_MASK)

#define FEED_DMA_TCD_TCD12_CSR_INTMAJOR_MASK     (0x2U)
#define FEED_DMA_TCD_TCD12_CSR_INTMAJOR_SHIFT    (1U)
#define FEED_DMA_TCD_TCD12_CSR_INTMAJOR_WIDTH    (1U)
#define FEED_DMA_TCD_TCD12_CSR_INTMAJOR(x)       (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_INTMAJOR_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_INTMAJOR_MASK)

#define FEED_DMA_TCD_TCD12_CSR_INTHALF_MASK      (0x4U)
#define FEED_DMA_TCD_TCD12_CSR_INTHALF_SHIFT     (2U)
#define FEED_DMA_TCD_TCD12_CSR_INTHALF_WIDTH     (1U)
#define FEED_DMA_TCD_TCD12_CSR_INTHALF(x)        (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_INTHALF_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_INTHALF_MASK)

#define FEED_DMA_TCD_TCD12_CSR_DREQ_MASK         (0x8U)
#define FEED_DMA_TCD_TCD12_CSR_DREQ_SHIFT        (3U)
#define FEED_DMA_TCD_TCD12_CSR_DREQ_WIDTH        (1U)
#define FEED_DMA_TCD_TCD12_CSR_DREQ(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_DREQ_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_DREQ_MASK)

#define FEED_DMA_TCD_TCD12_CSR_ESG_MASK          (0x10U)
#define FEED_DMA_TCD_TCD12_CSR_ESG_SHIFT         (4U)
#define FEED_DMA_TCD_TCD12_CSR_ESG_WIDTH         (1U)
#define FEED_DMA_TCD_TCD12_CSR_ESG(x)            (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_ESG_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_ESG_MASK)

#define FEED_DMA_TCD_TCD12_CSR_MAJORELINK_MASK   (0x20U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORELINK_SHIFT  (5U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORELINK_WIDTH  (1U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORELINK(x)     (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_MAJORELINK_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_MAJORELINK_MASK)

#define FEED_DMA_TCD_TCD12_CSR_ESDA_MASK         (0x80U)
#define FEED_DMA_TCD_TCD12_CSR_ESDA_SHIFT        (7U)
#define FEED_DMA_TCD_TCD12_CSR_ESDA_WIDTH        (1U)
#define FEED_DMA_TCD_TCD12_CSR_ESDA(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_ESDA_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_ESDA_MASK)

#define FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH_MASK  (0x1F00U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH_SHIFT (8U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH_WIDTH (5U)
#define FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH(x)    (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_MAJORLINKCH_MASK)

#define FEED_DMA_TCD_TCD12_CSR_BWC_MASK          (0xC000U)
#define FEED_DMA_TCD_TCD12_CSR_BWC_SHIFT         (14U)
#define FEED_DMA_TCD_TCD12_CSR_BWC_WIDTH         (2U)
#define FEED_DMA_TCD_TCD12_CSR_BWC(x)            (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_CSR_BWC_SHIFT)) & FEED_DMA_TCD_TCD12_CSR_BWC_MASK)
/*! @} */

/*! @name TCD12_BITER_ELINKNO - TCD Beginning Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER_MASK (0x7FFFU)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER_WIDTH (15U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER_SHIFT)) & FEED_DMA_TCD_TCD12_BITER_ELINKNO_BITER_MASK)

#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_SHIFT)) & FEED_DMA_TCD_TCD12_BITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD12_BITER_ELINKYES - TCD Beginning Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER_MASK (0x1FFU)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER_WIDTH (9U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER_SHIFT)) & FEED_DMA_TCD_TCD12_BITER_ELINKYES_BITER_MASK)

#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_SHIFT (9U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_WIDTH (5U)
#define FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_SHIFT)) & FEED_DMA_TCD_TCD12_BITER_ELINKYES_LINKCH_MASK)

