rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_DMLOE_MASK)

#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD5_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_NBYTES_MASK)

#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_MLOFF_MASK)

#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_DMLOE_MASK)

#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD5_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD5_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA_SHIFT)) & FEED_DMA_TCD_TCD5_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD5_DADDR - TCD Destination Address */
/*! @{ */

#define FEED_DMA_TCD_TCD5_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD5_DADDR_DADDR_SHIFT      (0U)
#define FEED_DMA_TCD_TCD5_DADDR_DADDR_WIDTH      (32U)
#define FEED_DMA_TCD_TCD5_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_DADDR_DADDR_SHIFT)) & FEED_DMA_TCD_TCD5_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD5_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define FEED_DMA_TCD_TCD5_DOFF_DOFF_MASK         (0xFFFFU)
#define FEED_DMA_TCD_TCD5_DOFF_DOFF_SHIFT        (0U)
#define FEED_DMA_TCD_TCD5_DOFF_DOFF_WIDTH        (16U)
#define FEED_DMA_TCD_TCD5_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_DOFF_DOFF_SHIFT)) & FEED_DMA_TCD_TCD5_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD5_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER_WIDTH (15U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER_SHIFT)) & FEED_DMA_TCD_TCD5_CITER_ELINKNO_CITER_MASK)

#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK_SHIFT)) & FEED_DMA_TCD_TCD5_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD5_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER_WIDTH (9U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER_SHIFT)) & FEED_DMA_TCD_TCD5_CITER_ELINKYES_CITER_MASK)

#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH_MASK (0x3E00U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH_SHIFT (9U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH_WIDTH (5U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH_SHIFT)) & FEED_DMA_TCD_TCD5_CITER_ELINKYES_LINKCH_MASK)

#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK_SHIFT)) & FEED_DMA_TCD_TCD5_CITER_ELINKYES_ELINK_MASK)
/*! @} */

/*! @name TCD5_DLAST_SGA - TCD Last Destination Address Adjustment / Scatter Gather Address */
/*! @{ */

#define FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA_MASK (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA_SHIFT (0U)
#define FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA_WIDTH (32U)
#define FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA_SHIFT)) & FEED_DMA_TCD_TCD5_DLAST_SGA_DLAST_SGA_MASK)
/*! @} */

/*! @name TCD5_CSR - TCD Control and Status */
/*! @{ */

