rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_FEED_DMA_TCD.h
#define FEED_DMA_TCD_CH6_PRI_ECP_MASK            (0x80000000U)
#define FEED_DMA_TCD_CH6_PRI_ECP_SHIFT           (31U)
#define FEED_DMA_TCD_CH6_PRI_ECP_WIDTH           (1U)
#define FEED_DMA_TCD_CH6_PRI_ECP(x)              (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_CH6_PRI_ECP_SHIFT)) & FEED_DMA_TCD_CH6_PRI_ECP_MASK)
/*! @} */

/*! @name TCD6_SADDR - TCD Source Address */
/*! @{ */

#define FEED_DMA_TCD_TCD6_SADDR_SADDR_MASK       (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD6_SADDR_SADDR_SHIFT      (0U)
#define FEED_DMA_TCD_TCD6_SADDR_SADDR_WIDTH      (32U)
#define FEED_DMA_TCD_TCD6_SADDR_SADDR(x)         (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_SADDR_SADDR_SHIFT)) & FEED_DMA_TCD_TCD6_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD6_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define FEED_DMA_TCD_TCD6_SOFF_SOFF_MASK         (0xFFFFU)
#define FEED_DMA_TCD_TCD6_SOFF_SOFF_SHIFT        (0U)
#define FEED_DMA_TCD_TCD6_SOFF_SOFF_WIDTH        (16U)
#define FEED_DMA_TCD_TCD6_SOFF_SOFF(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_SOFF_SOFF_SHIFT)) & FEED_DMA_TCD_TCD6_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD6_ATTR - TCD Transfer Attributes */
/*! @{ */

#define FEED_DMA_TCD_TCD6_ATTR_DSIZE_MASK        (0x7U)
#define FEED_DMA_TCD_TCD6_ATTR_DSIZE_SHIFT       (0U)
#define FEED_DMA_TCD_TCD6_ATTR_DSIZE_WIDTH       (3U)
#define FEED_DMA_TCD_TCD6_ATTR_DSIZE(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_ATTR_DSIZE_SHIFT)) & FEED_DMA_TCD_TCD6_ATTR_DSIZE_MASK)

#define FEED_DMA_TCD_TCD6_ATTR_DMOD_MASK         (0xF8U)
#define FEED_DMA_TCD_TCD6_ATTR_DMOD_SHIFT        (3U)
#define FEED_DMA_TCD_TCD6_ATTR_DMOD_WIDTH        (5U)
#define FEED_DMA_TCD_TCD6_ATTR_DMOD(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_ATTR_DMOD_SHIFT)) & FEED_DMA_TCD_TCD6_ATTR_DMOD_MASK)

#define FEED_DMA_TCD_TCD6_ATTR_SSIZE_MASK        (0x700U)
#define FEED_DMA_TCD_TCD6_ATTR_SSIZE_SHIFT       (8U)
#define FEED_DMA_TCD_TCD6_ATTR_SSIZE_WIDTH       (3U)
#define FEED_DMA_TCD_TCD6_ATTR_SSIZE(x)          (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_ATTR_SSIZE_SHIFT)) & FEED_DMA_TCD_TCD6_ATTR_SSIZE_MASK)

#define FEED_DMA_TCD_TCD6_ATTR_SMOD_MASK         (0xF800U)
#define FEED_DMA_TCD_TCD6_ATTR_SMOD_SHIFT        (11U)
#define FEED_DMA_TCD_TCD6_ATTR_SMOD_WIDTH        (5U)
#define FEED_DMA_TCD_TCD6_ATTR_SMOD(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_ATTR_SMOD_SHIFT)) & FEED_DMA_TCD_TCD6_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_NBYTES_MASK)

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_DMLOE_MASK)

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD6_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_NBYTES_MASK)

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF_MASK (0x3FFFFC00U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT (10U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF_WIDTH (20U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_MLOFF_MASK)

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE_MASK (0x40000000U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT (30U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_DMLOE_MASK)

#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE_MASK (0x80000000U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT (31U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE_WIDTH (1U)
#define FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE_SHIFT)) & FEED_DMA_TCD_TCD6_NBYTES_MLOFFYES_SMLOE_MASK)
/*! @} */

/*! @name TCD6_SLAST_SDA - TCD Last Source Address Adjustment / Store DADDR Address */
/*! @{ */

#define FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA_MASK (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA_SHIFT (0U)
#define FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA_WIDTH (32U)
#define FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA(x) (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA_SHIFT)) & FEED_DMA_TCD_TCD6_SLAST_SDA_SLAST_SDA_MASK)
/*! @} */

/*! @name TCD6_DADDR - TCD Destination Address */
/*! @{ */

#define FEED_DMA_TCD_TCD6_DADDR_DADDR_MASK       (0xFFFFFFFFU)
#define FEED_DMA_TCD_TCD6_DADDR_DADDR_SHIFT      (0U)
#define FEED_DMA_TCD_TCD6_DADDR_DADDR_WIDTH      (32U)
#define FEED_DMA_TCD_TCD6_DADDR_DADDR(x)         (((uint32_t)(((uint32_t)(x)) << FEED_DMA_TCD_TCD6_DADDR_DADDR_SHIFT)) & FEED_DMA_TCD_TCD6_DADDR_DADDR_MASK)
/*! @} */

/*! @name TCD6_DOFF - TCD Signed Destination Address Offset */
/*! @{ */

#define FEED_DMA_TCD_TCD6_DOFF_DOFF_MASK         (0xFFFFU)
#define FEED_DMA_TCD_TCD6_DOFF_DOFF_SHIFT        (0U)
#define FEED_DMA_TCD_TCD6_DOFF_DOFF_WIDTH        (16U)
#define FEED_DMA_TCD_TCD6_DOFF_DOFF(x)           (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_DOFF_DOFF_SHIFT)) & FEED_DMA_TCD_TCD6_DOFF_DOFF_MASK)
/*! @} */

/*! @name TCD6_CITER_ELINKNO - TCD Current Major Loop Count (Minor Loop Channel Linking Disabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER_MASK (0x7FFFU)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER_WIDTH (15U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER_SHIFT)) & FEED_DMA_TCD_TCD6_CITER_ELINKNO_CITER_MASK)

#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK_MASK (0x8000U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK_SHIFT (15U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK_WIDTH (1U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK_SHIFT)) & FEED_DMA_TCD_TCD6_CITER_ELINKNO_ELINK_MASK)
/*! @} */

/*! @name TCD6_CITER_ELINKYES - TCD Current Major Loop Count (Minor Loop Channel Linking Enabled) */
/*! @{ */

#define FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER_MASK (0x1FFU)
#define FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER_SHIFT (0U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER_WIDTH (9U)
#define FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER(x) (((uint16_t)(((uint16_t)(x)) << FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER_SHIFT)) & FEED_DMA_TCD_TCD6_CITER_ELINKYES_CITER_MASK)

